farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
static WifiProvState wifi_prov_state = WIFI_PROV_STA_CONNECTING;
static uint32_t wifi_sta_attempt_start_ms = 0;
// How long to wait for a saved network before falling back to AP portal.
static const uint32_t WIFI_STA_CONNECT_TIMEOUT_MS = 20000;

static DNSServer dnsServer;
static WebServer portalServer(80);
static const byte DNS_PORT = 53;
static IPAddress apIP(192, 168, 4, 1);
static String ap_ssid_str = "";  // "SpotWelder-XXXX"
// Cached network-scan <option> list. We scan ONCE when entering AP mode (and
// on explicit user rescan) instead of on every HTTP request. A blocking
// WiFi.scanNetworks() inside the request path delays the phone's captive-portal
// probe by 1-2 s, which is the main reason the setup page does not pop up
// reliably. Serving a cached list makes every portal response instant.
static String g_scan_options = "";
// Set true by the portal handler once new creds are saved; loop() then
// tears down the portal and reconnects in STA mode.
static volatile bool wifi_creds_just_saved = false;
// Last WiFi info pushed to the UI (avoids redundant ui_set_wifi_info calls).
static bool ui_wifi_last_connected = false;
static bool ui_wifi_last_ap = false;

static uint32_t lastTcpRxMs = 0;
static const uint32_t TCP_IDLE_TIMEOUT_MS = 600000;

// STM32 UART line limits
static const size_t MAX_LINE_LENGTH = 2048;
static const size_t MAX_WAVEFORM_LINE_LENGTH = 8192;

// =========================
// STM32-sourced INA226 data (parsed from STATUS2 packets)
// =========================
static float stm_vpack = 0.0f;
static float stm_vlow = 0.0f;
static float stm_vmid = 0.0f;
static float stm_cell1 = 0.0f;
static float stm_cell2 = 0.0f;
static float stm_cell3 = 0.0f;
static float stm_ichg = 0.0f;

/**
 * DISPLAY-ONLY VOLTAGE SMOOTHER FOR ESP32 TFT/LVGL
 * Prevents screen label flicker while keeping raw telemetry for logic/bridge.
 * Threshold: 0.005V (5mV)
 */
class VoltageDisplaySmoother {
   private:
    struct Channel {
        float lastValue;
        bool initialized;
    };

    static const int MAX_CHANNELS = 8;
    Channel channels[MAX_CHANNELS];
    float threshold;

   public:
    explicit VoltageDisplaySmoother(float thresh = 0.02f) : threshold(thresh) {
        for (int i = 0; i < MAX_CHANNELS; i++) {
            channels[i].initialized = false;
            channels[i].lastValue = 0.0f;
        }
    }

    float getDisplayValue(int channel, float rawValue) {
        if (channel < 0 || channel >= MAX_CHANNELS) return rawValue;

        if (!channels[channel].initialized) {
            channels[channel].lastValue = rawValue;
            channels[channel].initialized = true;
            return rawValue;
        }

        float delta = fabsf(rawValue - channels[channel].lastValue);
        if (delta < threshold) {
            return channels[channel].lastValue;
        }

        channels[channel].lastValue = rawValue;
        return rawValue;
    }
};

enum VoltageChannel {
    CH_VPACK = 0,
    CH_VCAP = 1,
    CH_CELL1 = 2,
    CH_CELL2 = 3,
    CH_CELL3 = 4,
    CH_VLOW = 5,
    CH_VMID = 6
};

// Global instance used only when rendering values on local TFT/LVGL.
static VoltageDisplaySmoother tftSmoother(0.005f);

// Voltage/energy naming migration (Phase 1B):
// - Canonical names from STM32: weld_v/cap_v + *_b/*_a and energy_*_j.
// - Backward compatibility: keep old vcap_b/vcap_a fields alive in bridge
// output.
// - TODO(Phase 2): remove legacy vcap_* compatibility fields once Flask/UI are
// fully migrated.
float weld_v = 0.0f;
float cap_v = 0.0f;
float weld_v_b = 0.0f;
float weld_v_a = 0.0f;
float cap_v_b = 0.0f;
float cap_v_a = 0.0f;
float vcap_b = 0.0f;  // legacy alias for weld_v_b
float vcap_a = 0.0f;  // legacy alias for weld_v_a
float energy_cap_j = 0.0f;
float energy_weld_j = 0.0f;
float energy_loss_j = 0.0f;

static float stm_vcap = 0.0f;         // legacy STATUS alias for weld_v
static float stm_power = 0.0f;        // weld power setting from STATUS
static bool stm_ina_ok = false;       // INA226 health flag from STATUS2
static bool stm_charger_on = false;   // chg_en field from STATUS2
static uint32_t last_status2_ms = 0;  // timestamp of last STATUS2

// Dual-path bridge timing:
// - STATUS2 is forwarded raw at 500ms cadence (graph/calc consumers)
// - DISPLAY is sent smoothed at 1000ms cadence (UI label consumers)
static String rawStatus2Packet;
static bool hasRawStatus2Data = false;
unsigned long lastStatus2Forward = 0;
unsigned long lastDisplayUpdate = 0;
const int STATUS2_INTERVAL = 500;
const int DISPLAY_INTERVAL = 1000;

// =========================
// UI / mirrored settings
// =========================
uint8_t weld_mode = 1;
uint16_t weld_d1 = 5;
uint16_t weld_gap1 = 0;
uint16_t weld_d2 = 0;
uint16_t weld_gap2 = 0;
uint16_t weld_d3 = 0;

uint8_t weld_power_pct = 100;

bool preheat_enabled = false;
uint16_t preheat_ms = 20;
uint8_t preheat_pct = 30;
uint16_t preheat_gap_ms = 3;

static float lead_resistance_ohms = 0.00200f;  // configurable, persisted
// Lead resistance is synced from the STM32 STATUS stream exactly once at boot
// (first valid, non-zero value). After that it is updated ONLY by calibration
// (CAL_RESULT) or an explicit SET_LEAD_R round-trip (ACK,LEAD_R). This prevents
// a stray "lead_r_ohm=0" in a periodic STATUS message from making the on-screen
// reading flash to "00".
static bool lead_r_synced_from_status = false;
static const float LEAD_RESISTANCE_MIN_OHMS = 0.0001f;
static const float LEAD_RESISTANCE_MAX_OHMS = 0.0100f;

// Local ESP32 UI range (mΩ) for Config tab lead resistance control.
static const float UI_LEAD_R_MIN_MOHM = 0.5f;
static const float UI_LEAD_R_MAX_MOHM = 5.0f;
static const float UI_LEAD_R_DEFAULT_MOHM = 2.0f;

// Tracks host-initiated LEAD_R updates that are waiting on STM32 ACK/DENY.
// This makes it explicit that ESP32 must not synthesize ACKs for SET_LEAD_R.
static bool lead_r_update_inflight = false;
static float pending_lead_r_ohms = NAN;

static const uint8_t TRIGGER_MODE_PEDAL = 1;
static const uint8_t TRIGGER_MODE_CONTACT = 2;

uint8_t trigger_mode = TRIGGER_MODE_PEDAL;
uint8_t contact_hold_steps = 2;  // each step = 0.5s
bool contact_with_pedal =
    false;  // require contact detection when pedal trigger

uint32_t weld_count = 0;  // running weld counter (incremented on WELD_DONE)

