farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    return status;
}

/**
 * Build DISPLAY packet with smoothed voltages for UI labels.
 * Sent at 1Hz to prevent flicker and uses a 5mV deadband.
 */
String buildDisplayPacket() {
    char buf[256];

    const float raw_vpack = stm_vpack;
    const float raw_cell1 = stm_cell1;
    const float raw_cell2 = stm_cell2;
    const float raw_cell3 = stm_cell3;
    const float raw_vcap = cap_v;

    float disp_vpack = tftSmoother.getDisplayValue(CH_VPACK, raw_vpack);
    float disp_cell1 = tftSmoother.getDisplayValue(CH_CELL1, raw_cell1);
    float disp_cell2 = tftSmoother.getDisplayValue(CH_CELL2, raw_cell2);
    float disp_cell3 = tftSmoother.getDisplayValue(CH_CELL3, raw_cell3);
    float disp_vcap = tftSmoother.getDisplayValue(CH_VCAP, raw_vcap);

    snprintf(buf,
             sizeof(buf),
             "DISPLAY,vpack=%.3f,vcap=%.3f,cell1=%.3f,cell2=%.3f,cell3=%.3f",
             disp_vpack,
             disp_vcap,
             disp_cell1,
             disp_cell2,
             disp_cell3);

    return String(buf);
}

void updateScreenDisplay() {
    // RAW telemetry path for logic/calculations/bridge packets.
    const float raw_vpack = stm_vpack;
    const float raw_cell1 = stm_cell1;
    const float raw_cell2 = stm_cell2;
    const float raw_cell3 = stm_cell3;
    const float raw_cap_v = cap_v;

    WelderDisplayState ds;

    // DISPLAY-ONLY smoothing path (local TFT/LVGL labels):
    ds.pack_voltage = tftSmoother.getDisplayValue(CH_VPACK, raw_vpack);
    ds.cell1_v = tftSmoother.getDisplayValue(CH_CELL1, raw_cell1);
    ds.cell2_v = tftSmoother.getDisplayValue(CH_CELL2, raw_cell2);
    ds.cell3_v = tftSmoother.getDisplayValue(CH_CELL3, raw_cell3);
    ds.cap_v = tftSmoother.getDisplayValue(CH_VCAP, raw_cap_v);

    ds.temperature = temperature_c;
    ds.charger_current = stm_charger_on ? stm_ichg : 0.0f;
    ds.weld_v = weld_v;
    ds.weld_v_b = weld_v_b;
    ds.weld_v_a = weld_v_a;
    ds.cap_v_b = cap_v_b;
    ds.cap_v_a = cap_v_a;

    // Keep derived math raw/authoritative.
    ds.weld_v_drop = weld_v_b - weld_v_a;
    ds.cap_v_drop = cap_v_b - cap_v_a;

    ds.energy_cap_j = energy_cap_j;
    ds.energy_weld_j = energy_weld_j;
    ds.energy_loss_j = energy_loss_j;
    ds.armed = stm_armed;
    ds.welding = welding_now;
    ds.charging = stm_charger_on;
    ds.weld_count = weld_count;
    ds.weld_mode = weld_mode;
    ds.pulse_d1 = weld_d1;
    ds.pulse_gap1 = weld_gap1;
    ds.pulse_d2 = weld_d2;
    ds.pulse_gap2 = weld_gap2;
    ds.pulse_d3 = weld_d3;
    ds.power_pct = weld_power_pct;
    ds.preheat_enabled = preheat_enabled;
    ds.preheat_ms = preheat_ms;
    ds.preheat_pct = preheat_pct;
    ds.preheat_gap_ms = preheat_gap_ms;
    ds.trigger_mode = trigger_mode;
    ds.contact_hold_steps = contact_hold_steps;

    // ---- Dashboard / Joule-mode mirrored state ----
    ds.control_mode        = control_mode;
    ds.joule_target_j      = joule_target_j;
    ds.joule_max_ms        = joule_max_ms;
    ds.joule_actual_j      = joule_actual_j;
    ds.lead_resistance_mohm = lead_resistance_ohms * 1000.0f;

    // Calibration freshness is session-based (ESP32 has no RTC).
    ds.cal_valid   = cal_done_this_session;
    ds.cal_age_sec = cal_done_this_session
                         ? (uint32_t)((millis() - last_cal_ms) / 1000UL)
                         : 0U;

    // ---- Last-weld latched results ----
    ds.last_weld_valid        = last_weld_valid;
    ds.last_weld_was_joule    = last_weld_was_joule;
    ds.last_weld_target_j     = last_weld_target_j;
    ds.last_weld_energy_j     = last_weld_energy_j;
    ds.last_weld_accuracy_pct = last_weld_accuracy_pct;
    ds.last_weld_duration_ms  = last_weld_duration_ms;
    ds.last_weld_peak_a       = last_weld_peak_a;
    ds.last_weld_avg_a        = last_weld_avg_a;
    ds.last_weld_lead_loss_j  = last_weld_lead_loss_j;

    ui_update(ds);
}

// =========================
// TCP / UART helpers
// =========================
void sendToPi(const String& msg) {
    if (client && client.connected()) {
        client.print(msg);
        client.print("\n");

        lastTcpRxMs = millis();  // ✅ FIX: treat TX as activity

        Serial.printf("[TCP] TX: %s\n", msg.c_str());
    }
}
void forwardToStm32(const String& line) {
    String out = line;
    out.trim();
    if (out.length() == 0) return;

    STM32Serial.print(out);
    STM32Serial.print("\r\n");
    STM32Serial.flush();

    if (!out.startsWith("READY,")) {
        Serial.printf("[UART->STM32] %s\n", out.c_str());
    }
}

void requestStm32Status() {
    if (!config_sent) return;  // gated until boot config sent
    forwardToStm32("STATUS");
}

// =========================
// STATUS2 parser (replaces old CHGSTAT parser)
// =========================
static void parseStatus2(const String& line) {
    int iv;
    float fv;

    // Extract INA226 health flag
    if (extractIntField(line, "ina_ok=", iv)) stm_ina_ok = (iv == 1);

    // Extract charger enable state
    if (extractIntField(line, "chg_en=", iv)) stm_charger_on = (iv == 1);

    // CHANGED: field name match for STM32 output
    if (extractFloatField(line, "vpack=", fv) ||
        extractFloatField(line, "vpack_ina=", fv)) {
        stm_vpack = fv;
    }

    if (extractFloatField(line, "vlow=", fv)) stm_vlow = fv;
    if (extractFloatField(line, "vmid=", fv)) stm_vmid = fv;

    // Extract individual cell voltages
    if (extractFloatField(line, "cell1=", fv)) stm_cell1 = fv;
    if (extractFloatField(line, "cell2=", fv)) stm_cell2 = fv;
    if (extractFloatField(line, "cell3=", fv)) stm_cell3 = fv;

    // Extract charge current
    if (extractFloatField(line, "ichg=", fv)) stm_ichg = fv;

    last_status2_ms = millis();
}

// =========================
// Front button
// =========================
void handleButton() {
    if (!config_sent) return;  // gated until boot config sent
    static unsigned long press_start = 0;
    static unsigned long last_release = 0;
    static bool was_pressed = false;
    static bool waiting_for_double = false;
    static unsigned long double_tap_window = 0;

    bool is_pressed = (digitalRead(BUTTON_PIN) == LOW);

    if (is_pressed && !was_pressed) {
        press_start = millis();
    } else if (!is_pressed && was_pressed) {
        unsigned long press_duration = millis() - press_start;
        unsigned long time_since_last = millis() - last_release;

        if (press_duration >= 2000) {
            Serial.println("Front button long press -> deep sleep");
            waiting_for_double = false;
            esp_deep_sleep_start();
        } else if (press_duration >= 50) {
            if (waiting_for_double && time_since_last <= 500) {
                Serial.println("Front button double tap -> ESP restart");
                delay(100);
                ESP.restart();
            } else {
                waiting_for_double = true;
                double_tap_window = millis();
            }
        }

