farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
        last_release = millis();
    }

    if (waiting_for_double && (millis() - double_tap_window > 500)) {
        bool target = !stm_armed;
        forwardToStm32(String("ARM,") + (target ? "1" : "0"));
        waiting_for_double = false;
    }

    was_pressed = is_pressed;
}

// =========================
// STM32 RX parser
// =========================
void pollStm32Uart() {
    static String stmLine;
    static bool stmLineOverflow = false;
    static uint32_t droppedUartLines = 0;

    while (STM32Serial.available()) {
        char ch = (char)STM32Serial.read();

        if (ch == '\r') continue;

        if (ch == '\n') {
            if (stmLineOverflow) {
                droppedUartLines++;
                Serial.printf(
                    "[UART] Dropped overlength STM32 line (%u chars buffered, "
                    "drops=%lu)\n",
                    (unsigned int)stmLine.length(),
                    (unsigned long)droppedUartLines);
                stmLine = "";
                stmLineOverflow = false;
                continue;
            }

            // Strip non-printable chars from UART line
            {
                String cleaned;
                cleaned.reserve(stmLine.length());
                for (unsigned int i = 0; i < stmLine.length(); i++) {
                    char c = stmLine[i];
                    if ((c >= 32 && c <= 126) || c == '\t') {
                        cleaned += c;
                    }
                }
                cleaned.trim();
                stmLine = cleaned;
            }

            if (stmLine.length() > 0) {
                // BOOT message handler – trigger safety re-sync
                if (stmLine.startsWith("BOOT,") || stmLine == "BOOT") {
                    Serial.printf("[Boot] STM32 boot detected: %s\n",
                                  stmLine.c_str());
                    stm32_booted = true;

                    uint32_t now = millis();
                    bool resync_allowed = (now - last_stm32_boot_sync_ms) >
                                          STM32_BOOT_RESYNC_DEBOUNCE_MS;

                    if (resync_allowed) {
                        if (!config_sent) {
                            sendBootConfig();
                        } else {
                            Serial.println(
                                "[Boot] STM32 reboot detected after initial "
                                "sync -> "
                                "re-syncing current live settings/state");
                            syncSettingsAfterUiReconnect();
                        }
                        last_stm32_boot_sync_ms = now;
                    } else {
                        Serial.println(
                            "[Boot] Ignoring duplicate BOOT message "
                            "(debounced)");
                    }

                    stmLine = "";
                    continue;
                }

                // STATUS2 packet from STM32 (INA226 data + charger state)
                if (stmLine.startsWith("STATUS2,")) {
                    parseStatus2(stmLine);
                    // Cache latest raw STATUS2 packet for timed forwarding.
                    rawStatus2Packet = stmLine;
                    hasRawStatus2Data = true;
                    // Log to serial so STATUS2 is visible in monitor
                    Serial.printf("[STM32->UART] %s\n", stmLine.c_str());
                    stmLine = "";
                    continue;
                }

                if (!isNoisyKeepaliveLine(stmLine)) {
                    Serial.printf("[STM32->UART] %s\n", stmLine.c_str());
                }

                if (stmLine.startsWith("ACK,ARM,")) {
                    int v = stmLine.substring(8).toInt();
                    stm_armed = (v == 1);
                    stm_synced = true;
                    sendToPi(stmLine);
                    sendToPi(buildStatus());

                } else if (stmLine.startsWith("ACK,READY")) {
                    int v = stm_ready ? 1 : 0;
                    int comma = stmLine.lastIndexOf(',');
                    if (comma >= 0 && (comma + 1) < (int)stmLine.length()) {
                        v = stmLine.substring(comma + 1).toInt();
                    }
                    stm_ready = (v == 1);
                    sendToPi(stmLine);

                } else if (stmLine.startsWith("ACK,SET_PULSE")) {
                    sendToPi(stmLine);
                    sendToPi(String("ACK,SET_PULSE,mode=") + String(weld_mode) +
                             ",d1=" + String(weld_d1) + ",gap1=" +
                             String(weld_gap1) + ",d2=" + String(weld_d2) +
                             ",gap2=" + String(weld_gap2) +
                             ",d3=" + String(weld_d3));
                    sendToPi(buildStatus());

                } else if (stmLine.startsWith("ACK,SET_POWER")) {
                    sendToPi(stmLine);
                    sendToPi(buildStatus());

                } else if (stmLine.startsWith("ACK,SET_PREHEAT")) {
                    sendToPi(stmLine);
                    sendToPi(String("ACK,SET_PREHEAT,en=") +
                             String(preheat_enabled ? 1 : 0) +
                             ",ms=" + String(preheat_ms) +
                             ",pct=" + String(preheat_pct) +
                             ",gap=" + String(preheat_gap_ms));
                    sendToPi(buildStatus());

                } else if (stmLine.startsWith("ACK,SET_TRIGGER_MODE")) {
                    int iv = 0;
                    if (extractIntField(stmLine, "mode=", iv)) {
                        trigger_mode = (uint8_t)iv;
                    }
                    sendToPi(stmLine);
                    sendToPi(buildStatus());

                } else if (stmLine.startsWith("ACK,SET_CONTACT_HOLD")) {
                    int iv = 0;
                    if (extractIntField(stmLine, "steps=", iv)) {
                        contact_hold_steps = (uint8_t)iv;
                    }
                    syncUiConfigFromRuntime();
                    sendToPi(stmLine);
                    sendToPi(buildStatus());

                } else if (stmLine.startsWith("ACK,SET_CONTACT_WITH_PEDAL")) {
                    int v =
                        stmLine.substring(strlen("ACK,SET_CONTACT_WITH_PEDAL,"))
                            .toInt();
                    contact_with_pedal = (v == 1);
                    syncUiConfigFromRuntime();
                    sendToPi(stmLine);
                    sendToPi(buildStatus());

                } else if (stmLine.startsWith("ACK,LEAD_R")) {
                    float fv = NAN;
                    if (extractFloatField(stmLine, "ohm=", fv) &&
                        isfinite(fv)) {
                        lead_resistance_ohms = fv;
                        save_lead_resistance_to_nvs();
                        // Authoritative SET_LEAD_R round-trip (ESP32 UI or
                        // Flask): lock out later STATUS-driven overwrites.
                        lead_r_synced_from_status = true;
                    }
                    lead_r_update_inflight = false;
                    pending_lead_r_ohms = NAN;
                    sendToPi(stmLine);
                    sendToPi(buildStatus());

                } else if (stmLine.startsWith("DENY,LEAD_R")) {
                    // STM32 rejected LEAD_R update, so clear pending state and
                    // forward authoritative DENY upstream.
                    lead_r_update_inflight = false;
                    pending_lead_r_ohms = NAN;
                    sendToPi(stmLine);
                    sendToPi(buildStatus());

                } else if (stmLine.startsWith("STATUS,")) {
                    int iv = 0;
                    float fv = NAN;

                    if (extractIntField(stmLine, "armed=", iv)) {
                        stm_armed = (iv == 1);
                    }

                    if (extractFloatField(stmLine, "vpack=", fv)) {
                        stm_vpack = fv;
                    }

                    if (extractIntField(stmLine, "ready=", iv)) {
                        stm_ready = (iv == 1);
                    }

                    // Voltage field migration parser:
                    // Prefer new canonical fields when present.
                    // Legacy fields are still parsed as fallback for old STM32
                    // FW.
                    bool got_weld_v = false;
                    if (extractFloatField(stmLine, "weld_v=", fv)) {
                        weld_v = fv;
                        stm_vcap = fv;  // legacy STATUS vcap alias
                        got_weld_v = true;
                    }
                    if (!got_weld_v &&
                        extractFloatField(stmLine, "vcap=", fv)) {
                        weld_v = fv;
                        stm_vcap = fv;
                    }

                    if (extractFloatField(stmLine, "cap_v=", fv)) {
                        cap_v = fv;
                    }

                    // STATUS may carry before/after points in some firmware
                    // variants.
                    if (extractFloatField(stmLine, "weld_v_b=", fv)) {
                        weld_v_b = fv;
                        vcap_b = fv;
                    } else if (extractFloatField(stmLine, "vcap_b=", fv)) {
                        weld_v_b = fv;
                        vcap_b = fv;
                    }
                    if (extractFloatField(stmLine, "weld_v_a=", fv)) {
                        weld_v_a = fv;
                        vcap_a = fv;
                    } else if (extractFloatField(stmLine, "vcap_a=", fv)) {
                        weld_v_a = fv;
                        vcap_a = fv;
                    }
                    if (extractFloatField(stmLine, "cap_v_b=", fv))
                        cap_v_b = fv;
                    if (extractFloatField(stmLine, "cap_v_a=", fv))
                        cap_v_a = fv;

                    if (extractFloatField(stmLine, "energy_cap_j=", fv))
                        energy_cap_j = fv;
                    if (extractFloatField(stmLine, "energy_weld_j=", fv))
                        energy_weld_j = fv;
                    if (extractFloatField(stmLine, "energy_loss_j=", fv))
                        energy_loss_j = fv;

                    // ---- Dashboard / Joule-mode mirror (display state) ----
                    if (extractIntField(stmLine, "control_mode=", iv))
                        control_mode = (uint8_t)iv;
                    if (extractFloatField(stmLine, "joule_target_j=", fv))
                        joule_target_j = fv;
                    if (extractIntField(stmLine, "joule_max_ms=", iv))
                        joule_max_ms = (uint16_t)iv;
                    // Live workpiece energy (lead-compensated control variable).
                    // Present only in JOULE-mode STATUS frames; holds the last
                    // weld's final energy between welds.
                    if (extractFloatField(stmLine, "joule_actual=", fv))
                        joule_actual_j = fv;

