farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
                    // ====
                    // RECIPE SYNC FROM STM32 STATUS
                    // ====
                    // ESP32 is the source of truth for recipe settings on boot.
                    // After boot config is sent, we suppress STM32 STATUS
                    // from overwriting recipe globals for a grace period
                    // (to let STM32 process our SET_* commands).
                    // After the grace period, we re-enable sync so the
                    // ESP32 stays in sync with STM32 for runtime changes.

                    {
                        // Grace period: don't let STATUS overwrite recipe
                        // for BOOT_GRACE_MS after boot config was sent.
                        // This prevents stale STM32 defaults from clobbering
                        // the NVS-loaded recipe we just pushed.
                        static const uint32_t BOOT_GRACE_MS = 2000;
                        bool allow_recipe_sync =
                            !config_sent ||
                            (config_sent_ms > 0 &&
                             (millis() - config_sent_ms) > BOOT_GRACE_MS);

                        if (allow_recipe_sync) {
                            // Pulse / timing
                            if (extractIntField(stmLine, "d1=", iv))
                                weld_d1 = (uint16_t)iv;
                            if (extractIntField(stmLine, "gap1=", iv))
                                weld_gap1 = (uint16_t)iv;
                            if (extractIntField(stmLine, "d2=", iv))
                                weld_d2 = (uint16_t)iv;
                            if (extractIntField(stmLine, "gap2=", iv))
                                weld_gap2 = (uint16_t)iv;
                            if (extractIntField(stmLine, "d3=", iv))
                                weld_d3 = (uint16_t)iv;

                            // Power
                            if (extractFloatField(stmLine, "power=", fv)) {
                                stm_power = fv;
                                weld_power_pct = (uint8_t)fv;
                            }

                            // Configurable lead resistance: sync from STM32
                            // STATUS only once at boot, and only for a valid
                            // non-zero value. Afterwards lead_r changes solely
                            // via calibration / SET_LEAD_R, so a stray
                            // lead_r_ohm=0 can't flash the on-screen reading.
                            if (!lead_r_synced_from_status &&
                                extractFloatField(stmLine, "lead_r_ohm=", fv) &&
                                isfinite(fv) && fv > 0.0f) {
                                lead_resistance_ohms = fv;
                                lead_r_synced_from_status = true;
                            }

                            // Preheat
                            if (extractIntField(stmLine, "preheat_en=", iv))
                                preheat_enabled = (iv == 1);
                            if (extractIntField(stmLine, "preheat_ms=", iv))
                                preheat_ms = (uint16_t)iv;
                            if (extractIntField(stmLine, "preheat_pct=", iv))
                                preheat_pct = (uint8_t)iv;
                            if (extractIntField(stmLine, "preheat_gap_ms=", iv))
                                preheat_gap_ms = (uint16_t)iv;

                            // Trigger / behavior
                            if (extractIntField(stmLine, "trigger_mode=", iv))
                                trigger_mode = (uint8_t)iv;
                            if (extractIntField(stmLine,
                                                "contact_hold_steps=", iv))
                                contact_hold_steps = (uint8_t)iv;
                            if (extractIntField(stmLine,
                                                "contact_with_pedal=", iv))
                                contact_with_pedal = (iv == 1);
                        } else {
                            // During grace period, still parse power for
                            // stm_power (read-only display) but don't
                            // overwrite recipe globals
                            if (extractFloatField(stmLine, "power=", fv))
                                stm_power = fv;
                            // Boot-only, non-zero lead_r sync (see note above).
                            if (!lead_r_synced_from_status &&
                                extractFloatField(stmLine, "lead_r_ohm=", fv) &&
                                isfinite(fv) && fv > 0.0f) {
                                lead_resistance_ohms = fv;
                                lead_r_synced_from_status = true;
                            }
                            Serial.println(
                                "[SYNC] Recipe sync suppressed (boot grace "
                                "period)");
                        }
                    }

                    // ====
                    // EXISTING CODE CONTINUES
                    // ====

                    if (extractFloatField(stmLine, "temp=", fv)) {
                        temperature_c = fv;
                        last_temp_update_ms = millis();
                    }

                    if (extractFloatField(stmLine, "iwfilt=", fv)) {
                        stm_weld_current = fv;
                    } else if (extractFloatField(stmLine, "iweld_v=", fv)) {
                        stm_weld_current = fv;
                    }

                    // Keep legacy vcap= parser path active for old STM32
                    // builds.
                    if (extractFloatField(stmLine, "vcap=", fv)) {
                        stm_vcap = fv;
                        if (!got_weld_v) {
                            weld_v = stm_vcap;
                        }
                    }

                    syncUiConfigFromRuntime();

