farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
                    stm_last_status_ms = millis();
                    stm_synced = true;

                    // ✅ DEBUG (optional but very useful)
                    Serial.printf("[SYNC] d1=%d power=%d preheat=%d\n", weld_d1,
                                  weld_power_pct, preheat_ms);

                    uint32_t now = millis();
                    if ((now - lastStatusForwardMs) >=
                        STATUS_FORWARD_MIN_INTERVAL_MS) {
                        sendToPi(buildStatus());
                        lastStatusForwardMs = now;
                    }

                } else if (stmLine.startsWith("EVENT,WELD_START")) {
                    welding_now = true;
                    last_weld_time = millis();
                    sendToPi(stmLine);
                    sendToPi(buildStatus());

                } else if (stmLine.startsWith("EVENT,WELD_DONE")) {
                    welding_now = false;
                    last_weld_time = millis();
                    weld_count++;
                    save_weld_count_to_nvs();  // persist across power cycles

                    float fv_done = NAN;
                    // New energy fields (Phase 1A/1B)
                    if (extractFloatField(stmLine, "energy_cap_j=", fv_done))
                        energy_cap_j = fv_done;
                    if (extractFloatField(stmLine, "energy_weld_j=", fv_done))
                        energy_weld_j = fv_done;
                    if (extractFloatField(stmLine, "energy_loss_j=", fv_done))
                        energy_loss_j = fv_done;

                    // Prefer new before/after voltage names when present.
                    if (extractFloatField(stmLine, "weld_v_b=", fv_done)) {
                        weld_v_b = fv_done;
                        vcap_b = fv_done;
                    } else if (extractFloatField(stmLine, "vcap_b=", fv_done)) {
                        weld_v_b = fv_done;
                        vcap_b = fv_done;
                    }
                    if (extractFloatField(stmLine, "weld_v_a=", fv_done)) {
                        weld_v_a = fv_done;
                        vcap_a = fv_done;
                    } else if (extractFloatField(stmLine, "vcap_a=", fv_done)) {
                        weld_v_a = fv_done;
                        vcap_a = fv_done;
                    }
                    if (extractFloatField(stmLine, "cap_v_b=", fv_done))
                        cap_v_b = fv_done;
                    if (extractFloatField(stmLine, "cap_v_a=", fv_done))
                        cap_v_a = fv_done;

                    // Optional instantaneous fields may be included by some
                    // builds.
                    if (extractFloatField(stmLine, "weld_v=", fv_done)) {
                        weld_v = fv_done;
                        stm_vcap = fv_done;
                    }
                    if (extractFloatField(stmLine, "cap_v=", fv_done))
                        cap_v = fv_done;

                    // ---- Latch last-weld results for the STATUS dashboard ----
                    {
                        int   iv_done = 0;
                        float jw = NAN;   // joule workpiece energy
                        float jl = NAN;   // joule lead loss
                        float ew = NAN;   // time-mode weld energy
                        float el = NAN;   // measured lead-loss energy

                        if (extractIntField(stmLine, "total_ms=", iv_done))
                            last_weld_duration_ms = (uint32_t)iv_done;
                        if (extractFloatField(stmLine, "peak_a=", fv_done))
                            last_weld_peak_a = fv_done;
                        if (extractFloatField(stmLine, "avg_a=", fv_done))
                            last_weld_avg_a = fv_done;

                        extractFloatField(stmLine, "joule_workpiece_j=", jw);
                        extractFloatField(stmLine, "joule_loss_j=", jl);
                        extractFloatField(stmLine, "energy_weld_j=", ew);
                        extractFloatField(stmLine, "energy_lead_j=", el);

                        last_weld_was_joule = (control_mode == 1U);
                        last_weld_target_j  = joule_target_j;

                        if (last_weld_was_joule && !isnan(jw)) {
                            last_weld_energy_j = jw;
                        } else if (!isnan(ew)) {
                            last_weld_energy_j = ew;
                        }
                        if (last_weld_was_joule && !isnan(jl)) {
                            last_weld_lead_loss_j = jl;
                        } else if (!isnan(el)) {
                            last_weld_lead_loss_j = el;
                        }

                        last_weld_accuracy_pct =
                            (last_weld_target_j > 0.0f)
                                ? (100.0f * last_weld_energy_j /
                                   last_weld_target_j)
                                : 0.0f;
                        last_weld_valid = true;
                    }

                    sendToPi(stmLine);
                    sendToPi(buildStatus());

                } else if (stmLine.startsWith("WAVEFORM,") ||
                           stmLine.startsWith("WAVEFORM_")) {
                    // Forward waveform packets transparently (legacy
                    // single-line format and chunked WAVEFORM_START/DATA/END
                    // format).
                    sendToPi(stmLine);
                    delayMicroseconds(200);  // gives WiFi stack breathing room
                } else if (stmLine.length() > 10 && isdigit(stmLine[0])) {
                    // Bare CSV waveform line (no prefix)
                    sendToPi(stmLine);
                    delayMicroseconds(200);

                } else if (stmLine.startsWith("EVENT,PEDAL_PRESS") ||
                           stmLine.startsWith("EVENT,ARM_TIMEOUT") ||
                           stmLine.startsWith("EVENT,READY_TIMEOUT") ||
                           stmLine.startsWith("DENY,") ||
                           stmLine.startsWith("ERR,")) {
                    sendToPi(stmLine);
                    sendToPi(buildStatus());

