farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
                } else if (stmLine.startsWith("IWDBG,")) {
                    sendToPi(stmLine);

                } else if (stmLine.startsWith("ACK,IWZERO,")) {
                    sendToPi(stmLine);
                    sendToPi(buildStatus());

                } else if (stmLine.startsWith("CAL_")) {
                    // Lead-resistance auto-calibration responses
                    // (CAL_STATUS / CAL_RESULT / CAL_ERROR). Forward
                    // transparently so the Pi/Flask calibration waiter and the
                    // web UI receive progress and the final measurement.
                    //
                    // Debug trace: every CAL_ line is logged so we can see
                    // exactly where the routine is (waiting for trigger,
                    // measuring, result, error/timeout) when diagnosing a
                    // "calibration never completes" report.
                    Serial.print("[Cal] STM32 -> ");
                    Serial.println(stmLine);

                    if (stmLine.startsWith("CAL_RESULT")) {
                        // Successful calibration this session: latch freshness
                        // so the CONFIG tab can show a relative age (no RTC).
                        cal_done_this_session = true;
                        last_cal_ms = millis();
                        float cal_ohm = NAN;
                        if (extractFloatField(stmLine, "CAL_RESULT=", cal_ohm)) {
                            lead_resistance_ohms = cal_ohm;
                            // Authoritative: don't let a later STATUS overwrite.
                            lead_r_synced_from_status = true;
                        }
                    }

                    // Drive the on-device touch UI calibration status line so
                    // it reflects live progress and leaves the "Calibrating..."
                    // state on a terminal CAL_RESULT / CAL_ERROR (incl. the
                    // STM32's 8 s TIMEOUT_NO_TRIGGER) instead of hanging on
                    // "keep leads shorted" forever. (Same task as
                    // lv_timer_handler() -> safe to touch LVGL directly.)
                    ui_notify_cal_message(stmLine.c_str());

                    sendToPi(stmLine);

                } else if (stmLine.startsWith("ACK,") ||
                           stmLine.startsWith("DENY,")) {
                    // Forward any ACK/DENY packet even if this firmware
                    // version doesn't have a dedicated handler for it yet.
                    sendToPi(stmLine);

                } else if (stmLine.startsWith("RXHEALTH,")) {
                    // keep local only
                }
            }

            stmLine = "";
        } else {
            if (stmLineOverflow) {
                continue;
            }

            size_t maxLineLength = MAX_LINE_LENGTH;
            if (stmLine.startsWith("WAVEFORM,") ||
                stmLine.startsWith("WAVEFORM_")) {
                maxLineLength = MAX_WAVEFORM_LINE_LENGTH;
            } else if (stmLine.length() < 9) {
                const char* wfPrefixes[] = {"WAVEFORM,", "WAVEFORM_"};
                bool possibleWaveform = false;
                for (size_t p = 0; p < 2 && !possibleWaveform; ++p) {
                    possibleWaveform = true;
                    for (size_t i = 0; i < stmLine.length(); ++i) {
                        if (stmLine[i] != wfPrefixes[p][i]) {
                            possibleWaveform = false;
                            break;
                        }
                    }
                }
                if (possibleWaveform) {
                    maxLineLength = MAX_WAVEFORM_LINE_LENGTH;
                }
            }

            if (stmLine.length() < maxLineLength) {
                stmLine += ch;
            } else {
                stmLineOverflow = true;
            }
        }
    }
}  // ← ADD THIS — closes pollStm32Uart()
// =========================
// Command parser
// =========================
void processCommand(String cmd) {
    cmd.trim();
    if (cmd.length() == 0) return;

    if (cmd == "PING") {
        sendToPi("ACK:PING");
        return;
    }

    if (cmd == "CELLS") {
        // CELLS now sourced from STM32 STATUS2 data
        char buf[160];
        snprintf(buf, sizeof(buf), "CELLS,C1=%.3f,C2=%.3f,C3=%.3f", stm_cell1,
                 stm_cell2, stm_cell3);
        sendToPi(String(buf));
        return;
    }

    if (cmd.startsWith("ACK,")) {
        Serial.printf("[TCP] Ignoring UI ACK: %s\n", cmd.c_str());
        return;
    }

    // Block STM32-forwarding commands until boot config sent
    if (!config_sent) {
        Serial.printf("[CMD] Dropped (pre-boot): %s\n", cmd.c_str());
        return;
    }

    Serial.printf("[CMD] Processing: %s\n", cmd.c_str());

    if (cmd.startsWith("SET_PULSE,")) {
        int values[6] = {0};
        int start = 10;

        for (int i = 0; i < 5; i++) {
            int commaPos = cmd.indexOf(',', start);
            if (commaPos < 0) {
                sendToPi("ERR:BAD_SET_PULSE");
                return;
            }
            values[i] = cmd.substring(start, commaPos).toInt();
            start = commaPos + 1;
        }
        values[5] = cmd.substring(start).toInt();

        weld_mode = values[0];
        weld_d1 = values[1];
        weld_gap1 = values[2];
        weld_d2 = values[3];
        weld_gap2 = values[4];
        weld_d3 = values[5];

        forwardToStm32(cmd);
        updateScreenDisplay();    // redraw touch UI with new values
        sendToPi(buildStatus());  // immediate STATUS to Flask (bypass throttle)
        lastStatusForwardMs =
            millis();  // reset throttle so next auto-STATUS doesn't double-fire
        return;
    }

    if (cmd.startsWith("SET_POWER,")) {
        weld_power_pct = cmd.substring(10).toInt();
        if (weld_power_pct < 50) weld_power_pct = 50;
        if (weld_power_pct > 100) weld_power_pct = 100;

        forwardToStm32(cmd);
        updateScreenDisplay();    // redraw touch UI with new values
        sendToPi(buildStatus());  // immediate STATUS to Flask (bypass throttle)
        lastStatusForwardMs =
            millis();  // reset throttle so next auto-STATUS doesn't double-fire
        return;
    }

