farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    if (cmd.startsWith("SET_PREHEAT,")) {
        int values[4] = {0};
        int start = 12;

        for (int i = 0; i < 3; i++) {
            int commaPos = cmd.indexOf(',', start);
            if (commaPos < 0) {
                sendToPi("ERR:BAD_SET_PREHEAT");
                return;
            }
            values[i] = cmd.substring(start, commaPos).toInt();
            start = commaPos + 1;
        }
        values[3] = cmd.substring(start).toInt();

        preheat_enabled = (values[0] == 1);
        preheat_ms = values[1];
        preheat_pct = values[2];
        preheat_gap_ms = values[3];

        forwardToStm32(cmd);
        updateScreenDisplay();    // redraw touch UI with new values
        sendToPi(buildStatus());  // immediate STATUS to Flask (bypass throttle)
        lastStatusForwardMs =
            millis();  // reset throttle so next auto-STATUS doesn't double-fire
        return;
    }

    if (cmd.startsWith("SET_LEAD_R,")) {
        float mohm = cmd.substring(strlen("SET_LEAD_R,")).toFloat();
        float ohms = mohm / 1000.0f;

        if (!isfinite(ohms) || ohms < LEAD_RESISTANCE_MIN_OHMS ||
            ohms > LEAD_RESISTANCE_MAX_OHMS) {
            sendToPi("ERR:LEAD_R_RANGE");
            return;
        }

        // LEAD_R flow MUST be authoritative from STM32:
        // 1) forward to STM32,
        // 2) wait for STM32 ACK/DENY,
        // 3) only then mirror persistence locally.
        // Never send a synthetic ACK from ESP32 here.
        pending_lead_r_ohms = ohms;
        lead_r_update_inflight = true;
        sendLeadResistanceToStm32(ohms);
        return;
    }

    if (cmd.startsWith("SET_TRIGGER_MODE,")) {
        int mode = cmd.substring(strlen("SET_TRIGGER_MODE,")).toInt();
        if (mode < TRIGGER_MODE_PEDAL) mode = TRIGGER_MODE_PEDAL;
        if (mode > TRIGGER_MODE_CONTACT) mode = TRIGGER_MODE_CONTACT;
        trigger_mode = (uint8_t)mode;

        forwardToStm32(cmd);
        updateScreenDisplay();    // redraw touch UI with new values
        sendToPi(buildStatus());  // immediate STATUS to Flask (bypass throttle)
        lastStatusForwardMs =
            millis();  // reset throttle so next auto-STATUS doesn't double-fire
        return;
    }

    if (cmd.startsWith("SET_CONTACT_HOLD,")) {
        int steps = cmd.substring(strlen("SET_CONTACT_HOLD,")).toInt();
        if (steps < 1) steps = 1;
        if (steps > 10) steps = 10;
        contact_hold_steps = (uint8_t)steps;

        forwardToStm32(cmd);
        updateScreenDisplay();    // redraw touch UI with new values
        sendToPi(buildStatus());  // immediate STATUS to Flask (bypass throttle)
        lastStatusForwardMs =
            millis();  // reset throttle so next auto-STATUS doesn't double-fire
        return;
    }

    if (cmd.startsWith("SET_CONTACT_WITH_PEDAL,")) {
        int val = cmd.substring(strlen("SET_CONTACT_WITH_PEDAL,")).toInt();
        contact_with_pedal = (val == 1);

        forwardToStm32(cmd);
        updateScreenDisplay();    // redraw touch UI with new values
        sendToPi(buildStatus());  // immediate STATUS to Flask (bypass throttle)
        lastStatusForwardMs =
            millis();  // reset throttle so next auto-STATUS doesn't double-fire
        return;
    }

    if (cmd == "RESET_WELD_COUNT") {
        weld_count = 0;
        save_weld_count_to_nvs();  // persist the reset across power cycles
        Serial.println("[Weld] Counter reset to 0");
        sendToPi(buildStatus());
        return;
    }

    if (cmd.startsWith("ARM,")) {
        forwardToStm32(cmd);
        updateScreenDisplay();    // redraw touch UI with new values
        sendToPi(buildStatus());  // immediate STATUS to Flask (bypass throttle)
        lastStatusForwardMs =
            millis();  // reset throttle so next auto-STATUS doesn't double-fire
        return;
    }

    if (cmd == "IWZERO" || cmd == "IWDBG") {
        forwardToStm32(cmd);
        updateScreenDisplay();    // redraw touch UI with new values
        sendToPi(buildStatus());  // immediate STATUS to Flask (bypass throttle)
        lastStatusForwardMs =
            millis();  // reset throttle so next auto-STATUS doesn't double-fire
        return;
    }

    if (cmd == "FIRE") {
        sendToPi("ACK:FIRE_IGNORED");
        return;
    }

    if (cmd == "STATUS") {
        sendToPi(buildStatus());
        requestStm32Status();
        return;
    }

    // Unknown command – forward raw to STM32 (passthrough for debug commands
    // like AMC_LIVE, DBG_SHUNT, etc.)
    Serial.printf("[PASSTHROUGH->STM32] %s\n", cmd.c_str());
    forwardToStm32(cmd);
    updateScreenDisplay();    // redraw touch UI with new values
    sendToPi(buildStatus());  // immediate STATUS to Flask (bypass throttle)
    lastStatusForwardMs =
        millis();  // reset throttle so next auto-STATUS doesn't double-fire
}

// =========================
// READY / UI connection
// =========================
void setUiConnected(bool connected) {
    if (connected == uiConnected) return;
    uiConnected = connected;

    if (uiConnected) {
        Serial.println("[READY] UI (TCP) connected");
        stm_synced = false;
        requestStm32Status();  // gated by config_sent
    } else {
        Serial.println("[READY] UI (TCP) disconnected -> ARM,0");
        if (config_sent) forwardToStm32("ARM,0");  // gated until boot config
        stm_synced = false;
    }
}

void serviceReadyHeartbeat() {
    if (!config_sent) return;  // gated until boot config sent
    uint32_t now = millis();
    if ((now - lastReadySentMs) >= READY_PERIOD_MS) {
        forwardToStm32("READY,1");
        lastReadySentMs = now;
    }
}

// =========================
// WiFi provisioning (captive portal + NVS credentials)
// =========================
// Credentials live in their own NVS namespace ("wificfg") so they are
// independent of recipe/config and survive power cycles. NVS on the ESP32 is
// stored in a dedicated flash partition; for at-rest encryption the project
// can enable NVS encryption (flash-encryption) at the build level — the keys
// here are plain string keys, the values are whatever the user provisions.

static void save_wifi_creds_to_nvs(const String& ssid, const String& pass) {
    Preferences wprefs;
    wprefs.begin("wificfg", false);
    wprefs.putString("ssid", ssid);
    wprefs.putString("pass", pass);
    wprefs.end();
    Serial.println("[WiFi] Credentials saved to NVS");
}

static void load_wifi_creds_from_nvs() {
    Preferences wprefs;
    wprefs.begin("wificfg", true);  // read-only
    wifi_ssid = wprefs.getString("ssid", "");
    wifi_pass = wprefs.getString("pass", "");
    wprefs.end();
    Serial.printf("[WiFi] Creds from NVS: ssid='%s' (%s)\n", wifi_ssid.c_str(),
                  wifi_ssid.length() ? "set" : "EMPTY");
}

// Build the per-device AP name from the last 2 bytes of the STA MAC.
static String makeApSsid() {
    uint8_t mac[6] = {0};
    WiFi.macAddress(mac);
    char buf[24];
    snprintf(buf, sizeof(buf), "SpotWelder-%02X%02X", mac[4], mac[5]);
    return String(buf);
}

// Push the current WiFi status to the UI (Setup tab + Status indicator),
// only when something actually changed to avoid redraw churn.
static void pushWifiInfoToUi(bool force) {
    bool connected;
    bool ap_mode;
    String ssid;
    String ip;
    int rssi = 0;

    if (wifi_prov_state == WIFI_PROV_AP_PORTAL) {
        connected = true;  // AP is up
        ap_mode = true;
        ssid = ap_ssid_str;
        ip = WiFi.softAPIP().toString();
    } else if (WiFi.status() == WL_CONNECTED) {
        connected = true;
        ap_mode = false;
        ssid = WiFi.SSID();
        ip = WiFi.localIP().toString();
        rssi = WiFi.RSSI();
    } else {
        connected = false;
        ap_mode = false;
        ssid = wifi_ssid;  // the network we are trying
        ip = "";
    }

    if (!force && connected == ui_wifi_last_connected &&
        ap_mode == ui_wifi_last_ap) {
        // Still refresh RSSI/IP occasionally even if connect-state is same.
        // (handled by periodic forced calls from loop)
    }
    ui_wifi_last_connected = connected;
    ui_wifi_last_ap = ap_mode;
    ui_set_wifi_info(connected, ap_mode, ssid.c_str(), ip.c_str(), rssi);
}

// ---- Captive portal HTTP handlers ----

