farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
// Rebuild the cached <option> list of nearby networks. Called ONCE on entering
// AP mode and on explicit user rescan — never from inside a normal page load,
// so the phone's captive-portal probe gets an instant response.
static void rescanNetworks() {
    int n = WiFi.scanNetworks();
    String opts = "";
    for (int i = 0; i < n && i < 30; i++) {
        String s = WiFi.SSID(i);
        if (s.length() == 0) continue;
        opts += "<option value=\"" + s + "\">" + s + " (" +
                String(WiFi.RSSI(i)) + " dBm)</option>";
    }
    WiFi.scanDelete();
    g_scan_options = opts;
    Serial.printf("[WiFi] Portal scan cached %d network(s)\n", n);
}

static String portalPageHtml() {
    // Use the cached scan list (see rescanNetworks). No blocking scan here.
    String opts = g_scan_options;

    String html =
        "<!DOCTYPE html><html><head><meta name='viewport' "
        "content='width=device-width,initial-scale=1'>"
        "<title>SpotWelder WiFi Setup</title><style>"
        "body{font-family:sans-serif;background:#0b1623;color:#eee;margin:0;"
        "padding:20px}h2{color:#39c}label{display:block;margin:14px 0 4px}"
        "input,select{width:100%;padding:10px;font-size:16px;border-radius:8px;"
        "border:1px solid #345;background:#13202f;color:#fff;box-sizing:border-box}"
        "button{margin-top:18px;width:100%;padding:14px;font-size:18px;"
        "background:#2a8;color:#fff;border:0;border-radius:8px}"
        ".card{max-width:420px;margin:auto;background:#13202f;padding:20px;"
        "border-radius:12px}</style></head><body><div class='card'>"
        "<h2>SpotWelder WiFi Setup</h2>"
        "<form action='/save' method='POST'>"
        "<label>Network</label><select name='ssid' id='ssid'>" +
        opts +
        "</select>"
        "<label>or type SSID</label><input name='ssid_manual' "
        "placeholder='(optional, overrides above)'>"
        "<label>Password</label><input name='pass' type='password' "
        "placeholder='WiFi password'>"
        "<button type='submit'>Save &amp; Connect</button>"
        "</form>"
        "<p style='text-align:center;margin-top:14px'>"
        "<a style='color:#39c' href='/?rescan=1'>&#x21bb; Rescan networks</a>"
        "</p>"
        "<p style='color:#789;font-size:13px;margin-top:16px'>"
        "The welder will reboot and join this network. If it fails it will "
        "return to this setup screen.</p></div></body></html>";
    return html;
}

// Send the portal page with no-cache headers so the phone does not cache a
// stale "no internet" verdict and re-shows the page on later probes.
static void sendPortalPage() {
    portalServer.sendHeader("Cache-Control",
                            "no-cache, no-store, must-revalidate");
    portalServer.sendHeader("Pragma", "no-cache");
    portalServer.sendHeader("Expires", "0");
    portalServer.send(200, "text/html", portalPageHtml());
}

static void handlePortalRoot() {
    if (portalServer.hasArg("rescan")) {
        rescanNetworks();
    }
    sendPortalPage();
}

// Captive-portal-detection (CPD) probe handler.
//
// When a phone joins the AP it immediately fetches an OS-specific "is there
// internet?" URL. To make the setup page pop up reliably we serve the portal
// page DIRECTLY (HTTP 200) for these probes instead of a redirect — iOS's
// Captive Network Assistant in particular is far more reliable when its probe
// (captive.apple.com/hotspot-detect.html) returns a non-"Success" page rather
// than a 302 to a bare IP. Android/Windows treat any non-expected response as
// "captive portal present" and surface the sign-in page too.
static void handleCaptive() { sendPortalPage(); }

static void handlePortalSave() {
    String ssid = portalServer.arg("ssid");
    String manual = portalServer.arg("ssid_manual");
    if (manual.length() > 0) ssid = manual;
    String pass = portalServer.arg("pass");
    ssid.trim();

    if (ssid.length() == 0) {
        portalServer.send(200, "text/html",
                          "<html><body style='font-family:sans-serif;"
                          "background:#0b1623;color:#eee;padding:24px'>"
                          "<h3>No network selected.</h3>"
                          "<a style='color:#39c' href='/'>Go back</a>"
                          "</body></html>");
        return;
    }

    save_wifi_creds_to_nvs(ssid, pass);
    wifi_ssid = ssid;
    wifi_pass = pass;

    portalServer.send(
        200, "text/html",
        "<html><head><meta name='viewport' "
        "content='width=device-width,initial-scale=1'></head>"
        "<body style='font-family:sans-serif;background:#0b1623;color:#eee;"
        "padding:24px'><h2>Saved!</h2><p>Connecting to <b>" +
            ssid +
            "</b>...</p><p>You can close this page. The welder display will "
            "show the connection status.</p></body></html>");

    wifi_creds_just_saved = true;  // loop() will reconnect
}

// Catch-all for any unmatched request (the bulk of OS captive-portal probes
// hit random hostnames/paths that DNS has already pointed at us).
//
// METHOD 3 (serve the portal page directly with HTTP 200) is used here rather
// than a 302 redirect, because it is the most reliable across all phone OSes:
//   - iOS Captive Network Assistant renders this HTML body straight into its
//     popup; it often abandons a 302 to a bare IP.
//   - Android sees a non-204 response and raises "Sign in to network".
//   - Windows sees content != "Microsoft Connect Test" and opens the browser.
// A 302 works on some devices but is the weaker option, which is likely why the
// page did not pop up automatically before.
static void handlePortalNotFound() { sendPortalPage(); }

// ---- Provisioning mode transitions ----
static void stopApPortal() {
    portalServer.stop();
    dnsServer.stop();
    WiFi.softAPdisconnect(true);
}

static void startApPortal() {
    Serial.println("[WiFi] Starting AP + captive portal (setup mode)");

    // Drop any STA bridge client / server.
    if (client) client.stop();
    server.stop();
    setUiConnected(false);

