farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    ap_ssid_str = makeApSsid();

    WiFi.mode(WIFI_AP);
    WiFi.softAPConfig(apIP, apIP, IPAddress(255, 255, 255, 0));
    // Open AP (no password) so the phone can auto-join from the QR code.
    WiFi.softAP(ap_ssid_str.c_str());
    delay(200);

    // Scan ONCE now, before any client connects, so portal page loads (and the
    // phone's captive-portal probe) are served instantly from cache.
    rescanNetworks();

    // Wildcard DNS: resolve every hostname to us. TTL 0 so phones don't cache.
    dnsServer.setTTL(0);
    dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
    dnsServer.start(DNS_PORT, "*", apIP);

    portalServer.on("/", handlePortalRoot);
    portalServer.on("/portal", handlePortalRoot);  // explicit alias
    portalServer.on("/save", HTTP_POST, handlePortalSave);
    // Captive-portal-detection probe endpoints (Android / iOS / Windows /
    // Firefox). Serving the page directly here is what makes the setup screen
    // pop up reliably across phones.
    portalServer.on("/generate_204", handleCaptive);         // Android
    portalServer.on("/gen_204", handleCaptive);              // Android (older)
    portalServer.on("/hotspot-detect.html", handleCaptive);  // iOS / macOS
    portalServer.on("/library/test/success.html", handleCaptive);  // iOS
    portalServer.on("/connecttest.txt", handleCaptive);      // Windows
    portalServer.on("/ncsi.txt", handleCaptive);             // Windows
    portalServer.on("/redirect", handleCaptive);             // Windows
    portalServer.on("/fwlink", handleCaptive);               // Windows / MSFT
    portalServer.on("/canonical.html", handleCaptive);       // Firefox / Linux
    portalServer.on("/success.txt", handleCaptive);          // Firefox / Linux
    portalServer.onNotFound(handlePortalNotFound);
    portalServer.begin();

    wifi_prov_state = WIFI_PROV_AP_PORTAL;
    wifi_creds_just_saved = false;

    Serial.printf("[WiFi] AP '%s' up at %s\n", ap_ssid_str.c_str(),
                  apIP.toString().c_str());

    // Tell the UI to show the QR provisioning view.
    //
    // The QR now encodes the SETUP-PAGE URL (http://192.168.4.1) instead of a
    // "WIFI:" auto-join string. Once the phone is connected to the SpotWelder
    // AP, scanning this URL QR makes the camera offer "Open in browser" and
    // jumps straight to the setup page — bypassing the unreliable captive-
    // portal auto-detection entirely. (Auto-join from a WIFI: QR proved flaky,
    // and the captive portal still didn't always pop, so the user had to type
    // the IP by hand. A URL QR is the most reliable path.)
    String qr = "http://" + apIP.toString();
    ui_show_wifi_setup(qr.c_str(), ap_ssid_str.c_str(),
                       apIP.toString().c_str());
    pushWifiInfoToUi(true);
}

// Begin (or restart) a STA connection attempt with the saved creds.
static void startStaConnect() {
    Serial.printf("[WiFi] Connecting (STA) to '%s'\n", wifi_ssid.c_str());
    WiFi.mode(WIFI_STA);
    // Set the DHCP hostname BEFORE WiFi.begin() so the router registers the
    // device as "spotwelder" (otherwise it falls back to the default
    // "esp32s3-XXXXXX"). This is what makes "spotwelder.local" resolve and what
    // shows up in the router's DHCP lease table. Must be set after WIFI_STA mode
    // and before begin() for the ESP32 Arduino core to apply it.
    WiFi.setHostname(OTA_HOSTNAME);
    esp_wifi_set_protocol(
        WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N);
    WiFi.disconnect(true);
    delay(100);
    WiFi.setHostname(OTA_HOSTNAME);  // re-assert after disconnect() (core quirk)
    WiFi.begin(wifi_ssid.c_str(), wifi_pass.c_str());
    wifi_prov_state = WIFI_PROV_STA_CONNECTING;
    wifi_sta_attempt_start_ms = millis();
    pushWifiInfoToUi(true);
}

// Public entry used by the boot sequence + the "Reconfigure WiFi" callback.
static void beginWifiProvisioning() {
    load_wifi_creds_from_nvs();
    if (wifi_ssid.length() == 0) {
        // First boot / no saved network -> go straight to the portal.
        startApPortal();
    } else {
        startStaConnect();
    }
}

// =========================
// OTA (over-the-air firmware update) support
// =========================
// A full-screen opaque LVGL overlay shows update status/progress so the operator
// sees what is happening while the device is being reflashed over WiFi.
//
// GLITCH-AVOIDANCE STRATEGY (why this is structured the way it is):
// On this Sunton board the RGB panel streams the framebuffer out of PSRAM. A
// full-frame flush (lv_refr_now) is a large synchronous PSRAM->LCD transfer. An
// OTA download simultaneously hammers the same PSRAM/SoC bus (WiFi RX + flash
// write), and if we flush the screen on every progress tick the two fight for
// the bus and the panel tears/scrambles -- exactly the glitching reported.
// So during OTA we (1) FREEZE all normal UI work via ota_in_progress, and
// (2) flush the progress bar only every ~5%, keeping bus contention minimal
// while still showing live progress.

// volatile: written from the ArduinoOTA callbacks and read in loop() to gate
// all normal UI/UART/TCP work while a transfer is running.
volatile bool ota_in_progress = false;  // set while an OTA transfer is running

// Progress-UI throttle. Each show_firmware_progress() call forces a full-frame
// 800x480 PSRAM->LCD flush (lv_refr_now); doing that on EVERY OTA packet (1000+
// times) serialises hundreds of slow synchronous flushes against the flash
// writes and stretched a 30-60 s update to 5+ minutes. We instead repaint only
// when the integer percent advances by >= 2 (plus a forced 0% and 100%), cutting
// it to ~50 flushes while still looking smooth. -1 = "nothing drawn yet".
static int ota_last_drawn_pct = -1;

// The live OTA progress UI is now the shared full-screen modal
// show_firmware_progress() / hide_firmware_progress() (defined in ui.cpp). With
// XIP-from-PSRAM enabled the CPU + RGB panel keep running while SPI flash is
// written, so we no longer hard-blank the screen during a transfer — the
// operator sees a real "ESP32 Firmware Update" progress bar instead of a black
// screen. The modal itself throttles nothing; the OTA callbacks below decide how
// often to push an update (we update per progress tick, which LVGL coalesces).

// =========================================================================
// RGB-panel drift / glitch recovery helpers
// -------------------------------------------------------------------------
// Root cause of the intermittent "whole image shifted / overscanned" glitch
// (seen on a plain reboot AND, worse, during an OTA flash):
//
//   The Sunton ESP32-8048S043C streams its 800x480x16bpp framebuffer (768 KB)
//   CONTINUOUSLY out of QSPI PSRAM (quad, 80 MHz) to feed the RGB panel. The
//   esp_lcd RGB refill / VSYNC-restart interrupt in the *precompiled* Arduino
//   libraries is NOT IRAM-safe (CONFIG_LCD_RGB_ISR_IRAM_SAFE is unset). So
//   whenever the SPI-flash cache is briefly disabled - NVS reads and WiFi RF
//   calibration loads during boot, and especially the sustained flash writes
//   during an OTA update - the panel's line DMA underruns, the scan-out pointer
//   slips, and the picture drifts. Historically only a power cycle cleared it.
//
// Two stock esp_lcd RGB APIs (available even with the precompiled libs) let us
// fix this in software:
//   * esp_lcd_rgb_panel_set_pclk()  - slow the pixel clock while flash is busy
//                                     (OTA) so the panel's PSRAM read demand
//                                     drops and the bus has room for the writes.
//   * esp_lcd_rgb_panel_restart()   - request a DMA re-sync at the next VSYNC,
//                                     recovering an already-drifted frame
//                                     without a power cycle.
// =========================================================================
#if defined(DISPLAY_ST7262_PAR)
static esp_lcd_panel_handle_t getRgbPanelHandle() {
    lv_display_t* disp = lv_display_get_default();
    if (!disp) return nullptr;
    return (esp_lcd_panel_handle_t)lv_display_get_user_data(disp);
}

// Re-align the panel scan-out DMA and repaint a full clean frame. Use after a
// flash-heavy window (boot, OTA abort) to clear any drift in software. Retained
// for manual recovery; the automatic post-boot resyncs were removed once XIP
// made boot drift a non-issue (hence the possibly-unused attribute).
static void resyncDisplayPanel(const char* reason) __attribute__((unused));
static void resyncDisplayPanel(const char* reason) {
    esp_lcd_panel_handle_t panel = getRgbPanelHandle();
    if (!panel) return;
    esp_err_t err = esp_lcd_rgb_panel_restart(panel);
    Serial.printf("[Display] RGB resync (%s): %s\n", reason ? reason : "",
                  esp_err_to_name(err));
    // Force LVGL to redraw the whole framebuffer so the restarted scan-out is
    // fed complete, correct pixel data.
    lv_obj_invalidate(lv_scr_act());
    lv_refr_now(lv_display_get_default());
}

// =========================================================================
// BOOT DISPLAY STABILIZATION  (fix for garbled/overlapping UI on cold boot)
// -------------------------------------------------------------------------
// Symptom: right after a power-on/reset the UI is drawn garbled, overlapping
// and shifted; a manual reset later corrects it. Root cause is a startup race:
//   1) smartdisplay_init() allocates the 800x480x16bpp framebuffer in PSRAM but
//      does NOT clear it, so it starts full of random power-on garbage.
//   2) The RGB panel's scan-out DMA begins streaming that garbage immediately,
//      while the early-boot flash-heavy window (NVS reads + WiFi RF-cal loads)
//      starves the non-IRAM RGB refill ISR, so the DMA scan-out pointer is
//      already drifted before LVGL even draws its first frame.
//   3) LVGL then renders the UI on top of a drifted/garbage scan-out -> the
//      "garbled, overlapping, misaligned" first screen.
//
// Fix (hardened): BEFORE any UI is created, (a) zero BOTH PSRAM framebuffers so
// there is no garbage to scan out, (b) flush the CPU cache back to PSRAM so the
// DMA (which reads PSRAM directly) actually sees the cleared bytes, then
// (c) restart the scan-out DMA TWICE (10 ms apart) to reliably re-align to a
// clean VSYNC even if the first restart lands inside a still-drifting frame.
// The caller keeps the backlight OFF across this window AND across the first
// LVGL render, so the operator never sees the power-on garbage.
//
// Why this is stronger than the previous single-restart version: on some cold
// boots a single esp_lcd_rgb_panel_restart() could be issued while the panel
// was still mid-drift, so the scan-out re-locked onto a shifted line offset and
// the UI came up rotated/garbled. memset alone also was not always visible to
// the DMA because the zeros could still be sitting in the CPU cache. Flushing
// the cache and restarting the DMA twice removes both of those race windows.
// =========================================================================
static void displayBootStabilize() {
    esp_lcd_panel_handle_t panel = getRgbPanelHandle();
    if (!panel) {
        Serial.println("[Display] boot stabilize: no RGB panel handle");
        return;
    }

    // (a) Zero BOTH PSRAM framebuffers so the panel scans out solid black
    //     instead of random power-on garbage. The RGB driver keeps two frame
    //     buffers in the double-buffered (bounce) config used here; clear both
    //     so neither buffer can ever be scanned out as garbage.
    void* fb0 = nullptr;
    void* fb1 = nullptr;
    const size_t fb_bytes = (size_t)DISPLAY_WIDTH * DISPLAY_HEIGHT * 2;  // RGB565
    bool have_fb0 = false, have_fb1 = false;
    // Try two buffers first (double-buffered configs); fall back to one.
    if (esp_lcd_rgb_panel_get_frame_buffer(panel, 2, &fb0, &fb1) == ESP_OK) {
        if (fb0) { memset(fb0, 0, fb_bytes); have_fb0 = true; }
        if (fb1) { memset(fb1, 0, fb_bytes); have_fb1 = true; }
        Serial.println("[Display] boot stabilize: cleared 2 framebuffers");
    } else if (esp_lcd_rgb_panel_get_frame_buffer(panel, 1, &fb0) == ESP_OK &&
               fb0) {
        memset(fb0, 0, fb_bytes);
        have_fb0 = true;
        Serial.println("[Display] boot stabilize: cleared 1 framebuffer");
    } else {
        Serial.println("[Display] boot stabilize: framebuffer fetch failed");
    }

    // (b) Flush the CPU data cache back to PSRAM. memset() above writes through
    //     the cache, but the RGB panel DMA reads PSRAM directly and bypasses the
    //     cache, so without this write-back the DMA could still fetch stale
    //     pre-clear garbage. esp_cache_msync(..., C2M) pushes the zeros out to
    //     PSRAM before we restart the scan-out.
    if (have_fb0 && fb0) {
        esp_cache_msync(fb0, fb_bytes, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
    }
    if (have_fb1 && fb1) {
        esp_cache_msync(fb1, fb_bytes, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
    }
    Serial.println("[Display] boot stabilize: PSRAM cache flushed (C2M)");

    // (c) Re-align the scan-out DMA to a clean VSYNC now that the buffer is
    //     black and flushed. Do it TWICE, 10 ms apart: a single restart can land
    //     while the panel is still mid-drift and re-lock onto a shifted offset,
    //     so a second restart after the panel has had a frame to settle makes
    //     the re-alignment reliable.
    esp_err_t err1 = esp_lcd_rgb_panel_restart(panel);
    Serial.printf("[Display] boot stabilize: DMA restart #1: %s\n",
                  esp_err_to_name(err1));
    delay(10);
    esp_err_t err2 = esp_lcd_rgb_panel_restart(panel);
    Serial.printf("[Display] boot stabilize: DMA restart #2: %s\n",
                  esp_err_to_name(err2));
}

// =========================================================================
// NOTE: the old OTA "hard-blank" workaround has been REMOVED.
// -------------------------------------------------------------------------
// Historically, an OTA / SD flash write would momentarily DISABLE the SPI-flash
// cache on every erase/program op. With code running from flash, the non-IRAM
// RGB refill ISR could not run during those windows and the panel scanned out
// garbage (the "color loop" crash), so we used to turn the backlight off and
// halt panel scan-out (displayBlankForOta/displayUnblankAfterOta) for the whole
// transfer — leaving the operator staring at a black screen.
//
// That is no longer necessary: the firmware now executes from PSRAM (XIP) with
// an IRAM-safe RGB refill path, so the CPU and panel keep running normally while
// SPI flash is being written. We can therefore paint a LIVE progress bar
// throughout the update (see show_firmware_progress()/hide_firmware_progress()).
// =========================================================================
#else
// Non-RGB panel build: these are no-ops so the call sites stay clean.
static inline void resyncDisplayPanel(const char*) {}
static inline void displayBootStabilize() {}
#endif

void setupOTA() {
    ArduinoOTA.setHostname(OTA_HOSTNAME);
    ArduinoOTA.setPassword(OTA_PASSWORD);
    ArduinoOTA.setPort(OTA_PORT);

    ArduinoOTA.onStart([]() {
        // FREEZE the normal UI. From here until reboot/error, loop() does no
        // tab rendering, no UART polling and no TCP work (see the ota_in_progress
        // guard in loop()), so the firmware download gets the PSRAM/SoC bus to
        // itself.
        ota_in_progress = true;

        String type =
            (ArduinoOTA.getCommand() == U_FLASH) ? "sketch" : "filesystem";
        Serial.println("[OTA] Start updating " + type);

        // Stop the TCP bridge so it cannot fight for time/heap/bus mid-update.
        if (client) client.stop();

