farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    Serial.println("\n[SD->ESP32] flash OK");
    snprintf(msg, msgn, "ESP32 firmware updated successfully. Restarting...");
    return true;
}

// Public entry (latched from the Setup-tab "UPDATE ESP32" button). Runs the
// flash, shows the modal completion popup, and reboots into the new image on
// success.
static bool updateESP32FromSD() {
    ota_in_progress = true;  // gate normal loop() work (UI/UART/TCP)
    char msg[128] = {0};
    bool ok = esp32FlashFromSD(msg, sizeof(msg));

    if (ok) {
        // Success reboots into the new image. Show 100% briefly, then stash the
        // result and let the freshly-booted firmware show the completion popup
        // once the display has settled (see the boot-popup logic in loop()).
        show_firmware_progress("ESP32", 100, "Update complete - restarting...");
        armBootFirmwarePopup(true, "ESP32", msg);
        delay(200);
        ESP.restart();  // never returns
    }
    // Failure path stays in the running app (no reboot): tear down the progress
    // modal and show the result popup right away so the operator can read the
    // error and retry. This is normal operation, so it is NOT deferred.
    hide_firmware_progress();
    show_firmware_result_popup(false, msg, "ESP32");
    ota_in_progress = false;
    return ok;
}

// ===========================================================================
// FLOW 2 — STM32 flash from SD over the ST ROM bootloader (AN3155)
// ===========================================================================

// --- AN3155 / bootloader constants ---
static const uint8_t STM_ACK = 0x79;
static const uint8_t STM_NACK = 0x1F;
static const uint8_t STM_INIT = 0x7F;
#define STM32_FLASH_BASE 0x08000000UL

// ===========================================================================
// LOW-LEVEL ESP-IDF UART I/O FOR BOOTLOADER MODE ONLY (UART_NUM_2, 115200 8E1)
// ===========================================================================
// Why ESP-IDF instead of Arduino HardwareSerial here:
//   The Arduino HardwareSerial (Serial2 / STM32Serial) wrapper did NOT reliably
//   transmit EVEN-parity bytes to the STM32 ROM bootloader, so the AN3155 0x7F
//   auto-baud + every command failed even though the STM32 was correctly sitting
//   in its ROM bootloader. The ESP-IDF uart driver lets us set UART_PARITY_EVEN
//   explicitly and feed bytes through the hardware FIFO + driver ISR + ring
//   buffer, which produces correct 8E1 framing. We use ESP-IDF ONLY for the
//   bootloader handshake/flash; the normal 2 Mbaud 8N1 application link still
//   uses Arduino STM32Serial. stm32FlashFromSD() installs the ESP-IDF driver on
//   UART_NUM_2 (after STM32Serial.end()) and stm32RestoreAppLink() removes it
//   and hands UART2 back to Arduino.
//
// The ESP-IDF UART number that maps to Arduino Serial2 / STM32Serial.
#define STM_BOOT_UART UART_NUM_2

// Write a buffer of bytes to the bootloader UART.
static IRAM_ATTR void stmWrite(const uint8_t* data, size_t len) {
    uart_write_bytes(STM_BOOT_UART, (const char*)data, len);
}

// Write a single byte to the bootloader UART.
static IRAM_ATTR void stmWriteByte(uint8_t b) {
    uart_write_bytes(STM_BOOT_UART, (const char*)&b, 1);
}

// Block until the bootloader UART TX FIFO has fully drained (replaces .flush()).
static IRAM_ATTR void stmFlushTx() {
    uart_wait_tx_done(STM_BOOT_UART, pdMS_TO_TICKS(1000));
}

// How many bytes are waiting in the bootloader UART RX ring buffer.
static IRAM_ATTR int stmRxAvailable() {
    size_t len = 0;
    uart_get_buffered_data_len(STM_BOOT_UART, &len);
    return (int)len;
}

// Read one byte with timeout (ms). Returns -1 on timeout. Uses the ESP-IDF
// driver's blocking read, which yields to other FreeRTOS tasks while waiting.
// NOTE on IRAM_ATTR (applies to every AN3155 helper below + stm32FlashFromSD):
// the build runs code from PSRAM (CONFIG_SPIRAM_XIP_FROM_PSRAM). PSRAM fetches
// are slower and can stall under bus contention; keeping these helpers in fast
// internal IRAM removes that jitter. (Byte framing itself is now handled by the
// ESP-IDF UART hardware FIFO + driver ISR, which is inherently timing-robust.)
static IRAM_ATTR int stmReadByte(uint32_t timeout_ms) {
    uint8_t b;
    int n = uart_read_bytes(STM_BOOT_UART, &b, 1, pdMS_TO_TICKS(timeout_ms));
    return (n == 1) ? (int)b : -1;
}

// Wait for an ACK (0x79). Logs NACK/timeout/unexpected bytes for diagnostics.
static IRAM_ATTR bool stmWaitAck(uint32_t timeout_ms) {
    int b = stmReadByte(timeout_ms);
    if (b == STM_ACK) return true;
    if (b == STM_NACK)
        Serial.println("[STM] NACK");
    else if (b < 0)
        Serial.println("[STM] timeout waiting for ACK");
    else
        Serial.printf("[STM] unexpected byte 0x%02X\n", b);
    return false;
}

// Drain (discard) any pending RX bytes. Returns how many bytes were dropped so
// the caller can log it during the verbose bootloader handshake.
static IRAM_ATTR int stmDrainRx() {
    int n = stmRxAvailable();
    if (n > 0) {
        // Discard everything currently buffered on the bootloader UART.
        uart_flush_input(STM_BOOT_UART);
    }
    return n;
}

// ESP-IDF variant of the RX hex dump, used inside the bootloader handshake
// (stmSync) where UART2 is owned by the ESP-IDF driver, not Arduino. Reads up
// to `max` bytes, giving late/slow bytes ~50 ms each to arrive.
static void stmDumpRxIDF(const char* tag, int max) {
    int count = 0;
    Serial.printf("[STM32-BOOT] %s: ", tag);
    while (count < max) {
        uint8_t b;
        int n = uart_read_bytes(STM_BOOT_UART, &b, 1, pdMS_TO_TICKS(50));
        if (n == 1) {
            Serial.printf("0x%02X ", b & 0xFF);
            count++;
        } else {
            break;
        }
    }
    if (count == 0)
        Serial.println("(no bytes)");
    else
        Serial.printf("  (%d byte%s)\n", count, count == 1 ? "" : "s");
}

// Verbose debug helper: read up to `max` bytes currently in the RX buffer and
// print them as a hex dump. Used when the bootloader handshake fails so we can
// see whether the STM32 sent ANYTHING (and what). Does not block long: it only
// waits a short moment for stragglers.
static void stmDumpRx(const char* tag, int max) {
    int count = 0;
    uint32_t t0 = millis();
    Serial.printf("[STM32-BOOT] %s: ", tag);
    // Give late bytes ~50 ms to arrive so we capture a full (slow) response.
    while (count < max && (millis() - t0 < 50)) {
        if (STM32Serial.available()) {
            int b = STM32Serial.read();
            Serial.printf("0x%02X ", b & 0xFF);
            count++;
            t0 = millis();  // reset window after each received byte
        } else {
            yield();
        }
    }
    if (count == 0)
        Serial.println("(no bytes)");
    else
        Serial.printf("  (%d byte%s)\n", count, count == 1 ? "" : "s");
}

