farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
// Send command byte + its complement, wait for ACK.
static IRAM_ATTR bool stmSendCmd(uint8_t cmd) {
    uint8_t b[2] = {cmd, (uint8_t)(cmd ^ 0xFF)};
    stmWrite(b, 2);
    stmFlushTx();
    return stmWaitAck(800);
}

// Bootloader auto-baud handshake: send 0x7F until the device answers.
// Verbose per-attempt logging so we can see exactly what (if anything) the
// STM32 ROM bootloader is sending back.
static IRAM_ATTR bool stmSync() {
    const int kAttempts = 10;
    for (int i = 0; i < kAttempts; i++) {
        int drained = stmDrainRx();
        if (drained > 0)
            Serial.printf("[STM32-BOOT] (drained %d stale byte%s before sync)\n",
                          drained, drained == 1 ? "" : "s");
        Serial.printf("[STM32-BOOT] Sync attempt %d/%d: sending 0x7F...\n",
                      i + 1, kAttempts);
        // --- TX debug: confirm bytes actually leave the ESP-IDF UART -------
        Serial.println("[DEBUG] About to write 0x7F...");
        int written = uart_write_bytes(STM_BOOT_UART, "\x7F", 1);
        Serial.printf("[DEBUG] Wrote %d bytes\n", written);
        uart_wait_tx_done(STM_BOOT_UART, 100 / portTICK_PERIOD_MS);  // wait TX complete
        Serial.println("[DEBUG] TX done");
        Serial.println("[STM32-BOOT] Waiting for ACK (0x79)...");
        int b = stmReadByte(500);
        if (b < 0) {
            Serial.println("[STM32-BOOT] Received: (timeout, no byte)");
        } else {
            Serial.printf("[STM32-BOOT] Received: 0x%02X\n", b & 0xFF);
        }
        if (b == STM_ACK) {
            Serial.println("[STM32-BOOT] sync OK (ACK)");
            return true;
        }
        if (b == STM_NACK) {
            // Already initialised this power cycle -> treat as connected.
            Serial.println(
                "[STM32-BOOT] sync OK (NACK = already initialised)");
            return true;
        }
        delay(200);  // give the ROM bootloader more time between sync attempts
    }
    Serial.printf("[STM32-BOOT] No response after %d attempts\n", kAttempts);
    Serial.printf("[STM32-BOOT] RX bytes available: %d\n", stmRxAvailable());
    stmDumpRxIDF("Dumping RX buffer", 64);
    return false;
}

// Get ID command (0x02) -> 12-bit product ID (G474 = 0x469).
static IRAM_ATTR bool stmGetId(uint16_t* id) {
    if (!stmSendCmd(0x02)) return false;
    int n = stmReadByte(500);  // number-of-bytes-minus-1 (=1 for a 2-byte ID)
    if (n < 0) return false;
    int hi = stmReadByte(500);
    int lo = stmReadByte(500);
    if (hi < 0 || lo < 0) return false;
    if (!stmWaitAck(500)) return false;
    if (id) *id = (uint16_t)(((hi & 0xFF) << 8) | (lo & 0xFF));
    return true;
}

// Extended Erase (0x44) global mass-erase (special code 0xFFFF, checksum 0x00).
static IRAM_ATTR bool stmMassErase() {
    if (!stmSendCmd(0x44)) return false;
    uint8_t e[3] = {0xFF, 0xFF, 0x00};  // special mass-erase code + checksum
    stmWrite(e, 3);
    stmFlushTx();
    return stmWaitAck(30000);  // a full mass erase can take several seconds
}

// Write Memory (0x31): up to 256 bytes (len = 1..256) at `addr`.
static IRAM_ATTR bool stmWriteChunk(uint32_t addr, const uint8_t* data, int len) {
    if (len < 1 || len > 256) return false;
    if (!stmSendCmd(0x31)) return false;
    uint8_t a[4] = {(uint8_t)(addr >> 24), (uint8_t)(addr >> 16),
                    (uint8_t)(addr >> 8), (uint8_t)addr};
    uint8_t acs = a[0] ^ a[1] ^ a[2] ^ a[3];
    uint8_t addrpkt[5] = {a[0], a[1], a[2], a[3], acs};
    stmWrite(addrpkt, 5);
    stmFlushTx();
    if (!stmWaitAck(800)) return false;

    uint8_t n = (uint8_t)(len - 1);  // device expects (count - 1)
    uint8_t cs = n;
    for (int i = 0; i < len; i++) cs ^= data[i];
    stmWriteByte(n);
    stmWrite(data, len);
    stmWriteByte(cs);
    stmFlushTx();
    return stmWaitAck(2000);
}

// Go (0x21): jump to and run the application at `addr`. In the software-
// bootloader flow this is how the freshly written STM32 application is launched
// (there is no NRST line to pulse), so it is called at the end of a flash.
static IRAM_ATTR bool stmGo(uint32_t addr) {
    if (!stmSendCmd(0x21)) return false;
    uint8_t a[4] = {(uint8_t)(addr >> 24), (uint8_t)(addr >> 16),
                    (uint8_t)(addr >> 8), (uint8_t)addr};
    uint8_t cs = a[0] ^ a[1] ^ a[2] ^ a[3];
    uint8_t pkt[5] = {a[0], a[1], a[2], a[3], cs};
    stmWrite(pkt, 5);
    stmFlushTx();
    return stmWaitAck(1000);
}

// Software jump-to-bootloader: ask the running STM32 application to reboot into
// its built-in ROM bootloader. Sent over the NORMAL application link (2 Mbaud,
// 8N1) BEFORE we switch the ESP32 UART to bootloader settings. The STM32
// firmware must implement a matching handler that, on receiving this line,
// calls its jump-to-system-memory routine (see the notes returned to the user).
// There is no hardware BOOT0/NRST line, so this command is the only way in.
static IRAM_ATTR void sendBootloaderCommand() {
    STM32Serial.print("BOOTLOADER");
    STM32Serial.print("\r\n");
    STM32Serial.flush();
}

// Restore the normal 2 Mbaud 8N1 application link to the STM32. Tears down the
// ESP-IDF bootloader UART driver first (it owns UART_NUM_2 during the flash),
// then re-opens UART2 with Arduino HardwareSerial for normal app comms.
static void stm32RestoreAppLink() {
    // Remove the ESP-IDF driver if it is installed (harmless no-op otherwise).
    if (uart_is_driver_installed(STM_BOOT_UART)) {
        uart_driver_delete(STM_BOOT_UART);
    }
    delay(100);
    STM32Serial.setRxBufferSize(8192);
    STM32Serial.begin(2000000, SERIAL_8N1, STM32_TO_ESP32_PIN,
                      ESP32_TO_STM32_PIN);
}

// ============================================================================
// STM32 SD-card flashing: HARDWARE BOOT0 entry (GPIO38 -> STM32 PB8).
// ----------------------------------------------------------------------------
// A control wire connects ESP32 GPIO38 to the STM32 BOOT0 pin (PB8), soldered
// directly to the WROOM module pad. This function drives BOOT0 HIGH, asks the
// STM32 app to NVIC_SystemReset(), and the chip comes up in its factory ROM
// bootloader (BOOT0 high at reset). It then flashes /stm32_firmware.bin over
// the existing GPIO17/18 UART link and drops BOOT0 LOW so the next boot runs
// the new app.
//
// Why this works where the old methods did not: the STM32G4 ROM bootloader does
// NOT come up USART-responsive after a software-only jump from the running app,
// and the option-byte experiment was unverified/fragile. A real reset with
// BOOT0 strapped HIGH is the ST-supported entry path and always responds to the
// AN3155 0x7F auto-baud.
//
// Recovery: an ST-LINK on the SWD header remains the guaranteed fallback if the
// STM32 is ever fully bricked. The GT911 touch I2C bus (GPIO19/20) is untouched.
// ============================================================================
//
// Inner worker: flashes the STM32 from /stm32_firmware.bin over the AN3155 ROM
// bootloader. Returns true on success and fills 'msg' with a short result in
// both cases. Does NOT reboot and does NOT show the popup - the thin wrapper
// flashSTM32FromSD() owns the completion popup and the (always-performed)
// reboot.
static bool stm32FlashFromSD(char* msg, size_t msgn) {
    // -- Pre-flight checks (display still ON; these are fast and may fail) -----
    size_t fw_size = 0;
    if (!sdFileExists(SD_STM32_FW_PATH, &fw_size)) {
        snprintf(msg, msgn, "%s not found on SD card", SD_STM32_FW_PATH);
        return false;
    }
    // STM32G474CE has 512 KB flash; sanity-check the image fits.
    if (fw_size < 256 || fw_size > (512u * 1024u)) {
        snprintf(msg, msgn, "STM32 image size out of range");
        return false;
    }

    File f = SD.open(SD_STM32_FW_PATH, FILE_READ);
    if (!f) {
        snprintf(msg, msgn, "Cannot open STM32 image");
        return false;
    }

    // ------------------------------------------------------------------------
    // Timing-safe flash with a live progress bar (the IRAM_ATTR approach)
    // ------------------------------------------------------------------------
    // Root cause of the earlier instability was NOT the display - it was that
    // with XIP-from-PSRAM enabled the AN3155 handshake helpers executed from
    // (slow, bus-contended) PSRAM, which delayed the UART2 RX servicing enough
    // to drop the timing-sensitive STM32 bootloader ACK (0x79) bytes. The fix
    // is to pin all of those helpers in fast internal RAM with IRAM_ATTR (done
    // above), so the protocol meets timing even while the panel keeps scanning
    // out of PSRAM. That lets us keep the display ON and show a real progress
    // bar again. We still disable WiFi for the duration of the flash to remove
    // its (bursty) bus/IRQ contention, and reconnect afterwards.
    bool wifi_was_connected = (WiFi.status() == WL_CONNECTED);
    WiFi.disconnect(true);
    WiFi.mode(WIFI_OFF);
    delay(100);

