farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    show_firmware_progress("STM32", 0, "Entering bootloader...");

    // --- Assert BOOT0 HIGH so the upcoming reset lands in the ROM bootloader ---
    // Drive the hardware BOOT0 line (GPIO38 -> STM32 PB8) HIGH and let it settle
    // BEFORE telling the STM32 to reset. With BOOT0 high at reset, the STM32
    // boots its factory ROM bootloader instead of the application - this is the
    // ST-supported hardware entry path (no option-byte writes, no software jump).
    Serial.println("[STM32-BOOT] Asserting BOOT0 HIGH (GPIO38)...");
    digitalWrite(STM32_BOOT0_PIN, HIGH);
    delay(100);  // let the BOOT0 level settle before the reset

    // --- Ask the STM32 app to reset into its ROM bootloader --------------------
    // Send the command over the CURRENT application link (2 Mbaud, 8N1) while it
    // is still open. The app simply ACKs and calls NVIC_SystemReset(). Because
    // BOOT0 is now held HIGH, the reset enters the ROM bootloader directly.
    Serial.println("[STM32-BOOT] Sending BOOTLOADER command at 2Mbaud...");
    sendBootloaderCommand();
    Serial.println("[STM32-BOOT] Command sent, waiting for STM32 reset...");
    delay(100);  // let the STM32 receive + ACK the command over the 2 Mbaud link

    // Capture whatever the STM32 app replied over the 2 Mbaud link (it should
    // echo "ACK,BOOTLOADER" before it resets). Seeing this confirms the command
    // was received and the app is about to jump to its ROM bootloader.
    stmDumpRx("App-link reply to BOOTLOADER cmd", 32);

    // The STM32 app acknowledges, waits ~50 ms, then issues NVIC_SystemReset()
    // and reboots into its ROM bootloader. The reset itself plus the ROM
    // start-up must FULLY complete before we switch the ESP32 UART and start the
    // 0x7F auto-baud, otherwise the very first sync bytes are lost while the MCU
    // is still resetting. Wait generously here - this is the single most common
    // cause of "bootloader did not respond".
    delay(200);  // wait for the STM32 reset + ROM bootloader entry

    Serial.println("[STM32-BOOT] Switching UART to 115200 8E1 (ESP-IDF driver)...");
    // ------------------------------------------------------------------------
    // Hand UART2 from Arduino HardwareSerial to the low-level ESP-IDF driver.
    // ------------------------------------------------------------------------
    // The Arduino HardwareSerial wrapper did not reliably produce EVEN parity
    // framing, so the STM32 ROM bootloader (which REQUIRES 8E1) never accepted
    // the 0x7F auto-baud byte. Installing the ESP-IDF uart driver and setting
    // UART_PARITY_EVEN explicitly gives correct 8E1 framing on the wire.
    STM32Serial.end();          // release the Arduino driver on UART2
    delay(100);                 // let the hardware settle

    // Make sure no stale ESP-IDF driver is already installed on this UART.
    if (uart_is_driver_installed(STM_BOOT_UART)) {
        uart_driver_delete(STM_BOOT_UART);
    }

    const uart_config_t bl_uart_config = {
        .baud_rate = 115200,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_EVEN,        // CRITICAL: STM32 ROM bootloader is 8E1
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .rx_flow_ctrl_thresh = 0,
        .source_clk = UART_SCLK_APB,
    };
    // RX/TX ring buffers 1024 B each; no event queue.
    uart_driver_install(STM_BOOT_UART, 1024, 1024, 0, NULL, 0);
    uart_param_config(STM_BOOT_UART, &bl_uart_config);
    // Same pins as Serial2: TX=GPIO18 -> STM32 RX, RX=GPIO17 <- STM32 TX.
    uart_set_pin(STM_BOOT_UART, ESP32_TO_STM32_PIN, STM32_TO_ESP32_PIN,
                 UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
    // --- Debug: confirm the ESP-IDF driver is installed + which pins -------
    Serial.println("[DEBUG] ESP-IDF UART driver installed");
    Serial.printf("[DEBUG] TX pin: %d, RX pin: %d\n", ESP32_TO_STM32_PIN,
                  STM32_TO_ESP32_PIN);
    delay(1000);  // long settling time before first transmit
    Serial.println("[DEBUG] Driver ready, flushing...");
    uart_flush(STM_BOOT_UART);   // clear any RX/TX residue
    delay(500);

    // The STM32 ROM bootloader needs plenty of settling time after the reset
    // before it is ready to auto-baud from the first 0x7F. Sending it too early
    // is the #1 cause of "bootloader did not respond". Wait generously:
    //   500 ms after the UART reconfigure + 500 ms after draining the RX
    //   buffer = 1000 ms total before the first sync attempt.
    delay(500);  // let the reopened UART + ROM bootloader fully settle
    int pre_drained = stmDrainRx();
    Serial.printf("[STM32-BOOT] UART configured, draining RX buffer... "
                  "(%d byte%s discarded)\n",
                  pre_drained, pre_drained == 1 ? "" : "s");
    delay(500);  // additional settle after draining RX, before first 0x7F

    bool ok = false;
    const char* err = nullptr;
    do {
        if (!stmSync()) {
            err = "STM32 bootloader did not respond";
            break;
        }
        uint16_t id = 0;
        if (stmGetId(&id))
            Serial.printf("[STM] product ID = 0x%03X%s\n", id,
                          (id == 0x469) ? " (G474 OK)" : "");

        show_firmware_progress("STM32", 5, "Erasing...");
        if (!stmMassErase()) {
            err = "STM32 mass-erase failed";
            break;
        }

        // -------------------------------------------------------------------
        // WRITE LOOP (display stays ON; IRAM-pinned helpers keep timing safe)
        // -------------------------------------------------------------------
        // 256-byte chunks with a watchdog feed + yield() between writes. The
        // progress modal is repainted in ~10% steps so the UI stays responsive
        // without flooding LVGL with a refresh on every single chunk.
        show_firmware_progress("STM32", 10, "Writing...");
        uint32_t addr = STM32_FLASH_BASE;
        size_t done = 0;
        uint8_t buf[256];
        bool werr = false;
        bool readErr = false;
        int last_drawn_pct = 10;
        while (done < fw_size) {
            size_t remain = fw_size - done;
            int want = (remain > sizeof(buf)) ? (int)sizeof(buf) : (int)remain;
            int r = f.read(buf, want);
            if (r <= 0) {
                // SD read failed/short before EOF -> real error, not success.
                readErr = true;
                break;
            }
            // Pad the final partial word up to a 4-byte boundary with 0xFF.
            while (r % 4) buf[r++] = 0xFF;
            if (!stmWriteChunk(addr, buf, r)) {
                werr = true;
                break;
            }
            addr += r;
            done += r;
            // Map write progress into the 10..95% band of the bar.
            int pct = 10 + (int)((done * 85) / fw_size);
            if (pct > 95) pct = 95;
            if (pct >= last_drawn_pct + 10 || done >= fw_size) {
                last_drawn_pct = pct;
                show_firmware_progress("STM32", pct, "Writing...");
            }
            esp_task_wdt_reset();  // cheap WDT feed (no-op if not subscribed)
            yield();               // let other FreeRTOS tasks run
        }
        if (readErr) {
            err = "SD card read error during STM32 write";
            break;
        }
        if (werr) {
            err = "STM32 write failed";
            break;
        }
        if (done < fw_size) {
            err = "STM32 write incomplete";
            break;
        }
        ok = true;
    } while (0);

    f.close();

