farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    // --- Release BOOT0 LOW (flashing done, success or fail) --------------------
    // Drop the hardware BOOT0 line so that any future reset boots the freshly
    // written application instead of re-entering the ROM bootloader. Done
    // unconditionally so a failed flash never leaves the STM32 stuck in DFU.
    digitalWrite(STM32_BOOT0_PIN, LOW);
    Serial.println("[STM32-BOOT] BOOT0 released LOW (normal boot restored)");

    if (ok) show_firmware_progress("STM32", 98, "Launching...");

    // Launch the freshly written application with the AN3155 "Go" command, then
    // restore the normal 2 Mbaud 8N1 application link settings. With BOOT0 now
    // LOW, every subsequent reset boots the application directly - no option-byte
    // restore needed (hardware BOOT0 control replaces the old software methods).
    if (ok) stmGo(STM32_FLASH_BASE);  // jump to the new app at 0x08000000
    stm32RestoreAppLink();

    // Reconnect WiFi if it was up before the flash (the wrapper reboots the
    // ESP32 shortly after, but restore the radio so nothing is left disabled
    // if that path ever changes).
    if (wifi_was_connected && wifi_ssid.length() > 0) {
        startStaConnect();
    }

    snprintf(msg, msgn, "%s",
             ok ? "STM32 firmware updated successfully. Restarting..."
                : (err ? err : "STM32 update failed"));
    return ok;
}

// Public entry (latched from the Setup-tab "UPDATE STM32" button). Runs the
// flash, shows the modal completion popup, then reboots the ESP32 so both sides
// start from a clean, re-synced application link.
static bool flashSTM32FromSD() {
    ota_in_progress = true;
    char msg[128] = {0};
    bool ok = stm32FlashFromSD(msg, sizeof(msg));

    // Touch (GPIO19/20) was never disturbed, but the STM32 link was reopened at
    // bootloader settings and the STM32 just rebooted into the (new) app. We
    // always reboot the ESP32 so both sides start from a clean, re-synced link.
    show_firmware_progress("STM32", 100,
                           ok ? "Update complete - restarting..."
                              : "Update failed - restarting...");

    // The STM32 flow always reboots the ESP32 (to re-sync the app link). The
    // result popup is currently DISABLED (see setup()) while we debug the flash
    // itself, so just log the outcome to the UART instead of arming a deferred
    // popup. (Re-enable by restoring armBootFirmwarePopup(ok, "STM32", msg).)
    Serial.printf("[STM32] flash %s: %s\n", ok ? "OK" : "FAIL", msg);
    delay(200);
    ESP.restart();  // never returns; relaunches clean app link on boot
    return ok;
}

// ---- UI button callbacks: only LATCH a request; loop() runs the transfer ----
static void onUpdateEsp32FromSD() { g_fw_request = FW_REQ_ESP32; }
static void onUpdateStm32FromSD() { g_fw_request = FW_REQ_STM32; }

// =========================
// Setup
// =========================
void setup() {
    Serial.begin(115200);
    delay(500);

    Serial.println();
    Serial.println("===========================================");
    Serial.println("ESP32 Spot Welder Controller Boot Sequence");
    Serial.println("===========================================");
    Serial.println("[Boot] 1/4 Initializing firmware...");

    // ==========================================================
    // FIRMWARE RESULT POPUP DISABLED (run FIRST, before any init)
    // ----------------------------------------------------------
    // The deferred firmware-update result popup is temporarily disabled while
    // we debug the STM32 flash itself (progress + result are visible on the
    // UART log). The post-flash popup was also able to wedge the device in a
    // boot loop: a stuck FAIL flag in RTC memory survived the reboot and was
    // re-detected every boot, and a crash before it could be consumed meant it
    // never cleared. To guarantee a clean boot we UNCONDITIONALLY wipe every
    // RTC firmware-result flag here, at the very top of setup(), before any
    // crash-prone display/WiFi/STM32 init runs. Nothing downstream will latch
    // or show a popup. (Re-enable later by restoring the latch logic.)
    if (rtc_fw_popup_magic == FW_BOOT_POPUP_MAGIC) {
        Serial.println("[Boot] Cleared pending firmware result flag "
                       "(popup disabled)");
    }
    rtc_fw_popup_magic = 0;
    rtc_fw_popup_success = false;
    rtc_fw_popup_device[0] = '\0';
    rtc_fw_popup_msg[0] = '\0';
    boot_fw_popup_pending = false;

    // --- UART to STM32 ---
    STM32Serial.setRxBufferSize(
        8192);  // LAMBO buffer for large waveform bursts
    STM32Serial.begin(2000000, SERIAL_8N1, STM32_TO_ESP32_PIN,
                      ESP32_TO_STM32_PIN);
    Serial.println("✅ STM32 UART bridge ready (Serial2 @ 2000000)");

    // --- STM32 BOOT0 control line (hardware bootloader entry) ---
    // GPIO38 is wired to the STM32 BOOT0 pin (PB8). Held LOW for normal
    // operation; driven HIGH only during SD firmware flashing so that the
    // STM32 reset lands in the ROM bootloader instead of the application.
    pinMode(STM32_BOOT0_PIN, OUTPUT);
    digitalWrite(STM32_BOOT0_PIN, LOW);
    Serial.println("✅ STM32 BOOT0 line (GPIO38) initialised LOW");

    // --- Front button ---
    pinMode(BUTTON_PIN, INPUT_PULLUP);

    // ==========================================================
    // DISPLAY + TOUCH INIT
    // smartdisplay_init() claims I2C_NUM_0 for GT911 at 400kHz
    // DO NOT call Wire.begin() after this – it conflicts!
    // ==========================================================
    Serial.println("Initializing display (smartdisplay)...");
    smartdisplay_init();  // creates the RGB panel + framebuffer and runs lv_init()

    // BOOT STABILIZATION: keep the backlight OFF, then clear the (uninitialised,
    // garbage-filled) PSRAM framebuffer and re-align the scan-out DMA BEFORE any
    // UI is created. This kills the garbled/overlapping/shifted first frame seen
    // on a cold boot (see displayBootStabilize() for the full root-cause notes).
    // The backlight is turned back on further below, only after LVGL has drawn
    // the real UI into the now-clean framebuffer, so the operator never sees the
    // power-on garbage.
    smartdisplay_lcd_set_backlight(0.0f);
    displayBootStabilize();
    Serial.println("✅ Display initialized (framebuffer cleared, DMA synced)");

    // ==========================================================
    // TOUCH INDEV OVERRIDE – wrap smartdisplay driver with filter
    // ==========================================================
    lv_indev_t* indev = lv_indev_get_next(nullptr);
    bool found_touch = false;

    while (indev != nullptr) {
        if (lv_indev_get_type(indev) == LV_INDEV_TYPE_POINTER) {
            Serial.println(
                "✅ Touch indev found – wrapping with debounce filter");
            original_read_cb = indev->read_cb;
            indev->read_cb = debounced_touchpad_read;
            found_touch = true;
            break;
        }
        indev = lv_indev_get_next(indev);
    }

    if (!found_touch) {
        Serial.println("⚠️ No touch indev found from smartdisplay!");
    }

    // ==========================================================
    // LVGL UI
    // ==========================================================
    ui_init(onArmToggle, onRecipeApply);
    Serial.println("✅ UI created (5-tab shell + Pulse tab)");

