farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    // Render the real UI into the (already-cleared) framebuffer, then turn the
    // backlight back on. The backlight is still OFF here, so everything below
    // happens off-screen. We render TWICE with a settle delay in between:
    //
    //   * First render: draws the freshly-created widgets into the framebuffer.
    //   * 150 ms settle (was 50 ms): gives the just-restarted scan-out DMA
    //     several full panel frames (~29 Hz => ~35 ms/frame) to lock onto the
    //     clean buffer before anything is shown. The longer delay is what fixes
    //     the *intermittent* corruption — 50 ms was sometimes too short for the
    //     DMA to fully re-align on a cold boot.
    //   * Second render: repaints the whole UI over the now-settled, correctly
    //     aligned scan-out, guaranteeing the first visible frame is clean even
    //     if the first render raced an in-flight re-alignment.
    //
    // Only after both renders is the backlight enabled, so the operator never
    // sees the power-on garbage, a half-drawn frame, or a shifted/rotated UI.
    lv_timer_handler();        // let LVGL process the freshly-created widgets
    lv_refr_now(NULL);         // first synchronous full-frame flush to the panel
    delay(150);                // settle: let the re-aligned DMA lock on (was 50)
    lv_refr_now(NULL);         // second flush over the now-stable scan-out
    smartdisplay_lcd_set_backlight(1.0f);
    Serial.println("✅ Backlight on (UI dual-rendered into clean framebuffer)");

    // --- Config: Load settings from NVS into memory (Phase 1: NO STM32 sends
    // here) ---
    {
        ConfigState cfg = load_config_from_nvs();

        // Apply brightness immediately (local display only, not STM32)
        apply_brightness(cfg.brightness);

        // Apply touch sensitivity to the GT911 (controller already initialised
        // by smartdisplay_init above, so its config block is writable now).
        applyTouchSensitivity(cfg.touch_sensitivity);

        // Restore recipe from NVS if enabled – into globals only, NOT sent to
        // STM32
        if (cfg.load_last_on_boot) {
            load_recipe_from_nvs();
            Serial.println(
                "[Config] Load-last-on-boot: recipe loaded to memory (deferred "
                "send)");
        }

        // Sync globals from loaded config (no STM32 commands)
        // Force safety-critical defaults regardless of NVS
        // (user can change after boot, but we always start safe)
        stm_armed = false;                  // DISARMED
        trigger_mode = TRIGGER_MODE_PEDAL;  // MANUAL/PEDAL
        contact_with_pedal = true;          // require pedal gating
        load_lead_resistance_from_nvs();
        load_weld_count_from_nvs();  // restore lifetime weld counter

        // Push loaded config to UI widgets (display-side only)
        ui_set_config_cb(onConfigChange);
        ui_load_config(cfg);
        Serial.println(
            "✅ Config loaded into memory (STM32 send deferred to "
            "boot/timeout)");
    }

    // --- Safety defaults (always on ESP32 reboot) ---
    Serial.println("[Boot] 2/4 Applying safety defaults...");
    stm_armed = false;  // always boot disarmed
    stm_synced = false;
    trigger_mode = TRIGGER_MODE_PEDAL;  // always boot in pedal mode
    contact_with_pedal = true;          // pedal gating enabled

    Serial.println("[Boot] Safety defaults applied:");
    Serial.println("       - Armed: false");
    Serial.println("       - Trigger mode: PEDAL");
    Serial.println("       - Contact with pedal: enabled");
    Serial.printf(
        "[Boot] Persistent recipe retained: mode=%u d1=%u gap1=%u d2=%u "
        "gap2=%u d3=%u power=%u preheat_en=%u preheat_ms=%u preheat_pct=%u "
        "preheat_gap=%u\n",
        (unsigned)weld_mode, (unsigned)weld_d1, (unsigned)weld_gap1,
        (unsigned)weld_d2, (unsigned)weld_gap2, (unsigned)weld_d3,
        (unsigned)weld_power_pct, (unsigned)(preheat_enabled ? 1 : 0),
        (unsigned)preheat_ms, (unsigned)preheat_pct, (unsigned)preheat_gap_ms);

    // --- Register remaining UI callbacks ---
    ui_set_trigger_source_cb(onTriggerSourceChange);
    ui_set_weld_count_reset_cb(onWeldCountReset);
    ui_set_contact_with_pedal_cb(onContactWithPedalChange);

    // --- New dashboard / Joule / Calibration callbacks ---
    ui_set_calibrate_cb(onCalibrate);
    ui_set_joule_apply_cb(onJouleApply);
    ui_set_contact_delay_cb(onContactDelayChange);

    // --- Setup-tab (WiFi provisioning / maintenance) callbacks ---
    ui_set_wifi_reconfigure_cb(onWifiReconfigure);
    ui_set_restart_cb(onDeviceRestart);
    ui_set_factory_reset_cb(onFactoryReset);

    // --- Firmware-update (SD card) callbacks ---
    ui_set_fw_update_esp32_cb(onUpdateEsp32FromSD);
    ui_set_fw_update_stm32_cb(onUpdateStm32FromSD);
    Serial.println("[Boot] UI callbacks registered");

    // --- microSD card (firmware-update source) ---
    if (sdEnsureMounted()) {
        size_t sz = 0;
        Serial.printf("[SD] esp32_firmware.bin present: %s\n",
                      sdFileExists(SD_ESP32_FW_PATH, &sz) ? "yes" : "no");
        Serial.printf("[SD] stm32_firmware.bin present: %s\n",
                      sdFileExists(SD_STM32_FW_PATH, &sz) ? "yes" : "no");
    }

    // --- Populate static System Info on the Setup tab ---
    ui_set_system_info(FW_VERSION, ESP.getChipModel(),
                       (uint32_t)ESP.getFlashChipSize(),
                       (uint32_t)weld_count);

    // ==========================================================
    // WiFi provisioning (non-blocking, cooperative with LVGL)
    //   - Loads creds from NVS and connects (STA), OR
    //   - Starts the AP captive portal + QR code if no creds.
    // ==========================================================
    Serial.println("[Boot] 4/4 Starting WiFi provisioning + TCP services...");
    beginWifiProvisioning();

    // Pick up a firmware-update result stashed before the last warm reboot.
    // We only LATCH it here (and immediately consume the RTC flag so it can
    // never show twice); the popup itself is shown later from loop(), once the
    // display has fully settled. The magic check rejects the uninitialised RTC
    // garbage seen on a true cold power-on.
    if (rtc_fw_popup_magic == FW_BOOT_POPUP_MAGIC) {
        boot_fw_popup_pending = true;
        boot_fw_popup_success = rtc_fw_popup_success;
        snprintf(boot_fw_popup_device, sizeof(boot_fw_popup_device), "%s",
                 rtc_fw_popup_device);
        snprintf(boot_fw_popup_msg, sizeof(boot_fw_popup_msg), "%s",
                 rtc_fw_popup_msg);
        rtc_fw_popup_magic = 0;  // consume: one-shot
        Serial.printf("[Boot] Deferred firmware popup pending (%s, %s)\n",
                      boot_fw_popup_device,
                      boot_fw_popup_success ? "OK" : "FAIL");
    }

