farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    setup_done_ms = millis();
    Serial.println(
        "[Boot] Boot complete - waiting for STM32 BOOT/fallback sync");
    Serial.println("===========================================");
}

// Loop
// =========================
static unsigned long lv_last_tick = 0;

void loop() {
    // --- LVGL tick (must run before any early-return so timing stays sane) ---
    unsigned long now_ms = millis();
    lv_tick_inc(now_ms - lv_last_tick);
    lv_last_tick = now_ms;

    // --- Service OTA FIRST ---------------------------------------------------
    // ArduinoOTA.handle() is cheap when idle. When a transfer starts it BLOCKS
    // here for the whole download, driving the progress overlay from its own
    // (throttled) callbacks. The ota_in_progress guard below is the safety net
    // for the brief window before handle() blocks and for the post-error path:
    // while an OTA is active we skip ALL normal work (UI render, UART, TCP) so
    // the download owns the PSRAM/SoC bus and the screen does not glitch.
    if (WiFi.status() == WL_CONNECTED) {
        ArduinoOTA.handle();
    }
    if (ota_in_progress) {
        delay(10);  // yield to WiFi/flash; no UI/UART/TCP during the update
        return;
    }

    // --- Deferred firmware-update requests (run OUTSIDE the LVGL event path) -
    // The CONFIG-tab buttons only latch g_fw_request; the actual (long,
    // blocking) flash runs here so it never re-enters lv_timer_handler. Both
    // flows reboot on completion; the ESP32 error path returns here with the
    // panel/touch intact so the operator can read the message and retry.
    if (g_fw_request != FW_REQ_NONE) {
        uint8_t req = g_fw_request;
        g_fw_request = FW_REQ_NONE;
        if (req == FW_REQ_ESP32)
            updateESP32FromSD();
        else if (req == FW_REQ_STM32)
            flashSTM32FromSD();
        return;
    }

    // --- Normal UI servicing (only when NOT doing OTA) ---
    lv_timer_handler();

    // --- Post-boot display drift recovery (REMOVED) -------------------------
    // Previously the panel was re-aligned 3x over the first ~9 s (at 2/5/9 s) to
    // recover from the scan-out "drift" caused by the non-IRAM-safe RGB refill
    // ISR being starved during the flash-heavy early boot (NVS + WiFi RF cal).
    // That root cause is now fixed: the firmware executes from PSRAM (XIP) with
    // an IRAM-safe refill path, so the panel no longer drifts on boot. The three
    // periodic resyncs were therefore redundant and each caused a brief visible
    // flicker, so they have been removed for a clean, flicker-free startup. The
    // resyncDisplayPanel() helper is retained for manual recovery if ever needed.

    // --- Deferred firmware-update completion popup --------------------------
    // A firmware update that rebooted the ESP32 stashed its result in RTC
    // memory; setup() latched it into boot_fw_popup_pending. Show it ONCE, after
    // a short settle (FW_BOOT_POPUP_DELAY_MS, now 300ms) post-boot — the
    // framebuffer clear + dual DMA restart already ran in setup() and the panel
    // is solid from the first frame (XIP). This is gated to the boot window and
    // runs at most once per boot, so it never interferes with a running update.
    if (boot_fw_popup_pending && setup_done_ms > 0 &&
        (now_ms - setup_done_ms) >= FW_BOOT_POPUP_DELAY_MS) {
        boot_fw_popup_pending = false;  // one-shot
        show_firmware_result_popup(boot_fw_popup_success, boot_fw_popup_msg,
                                   boot_fw_popup_device);
        Serial.println("[Boot] Showed deferred firmware-update popup");
    }

    // --- Phase 1: fallback timeout – send config if no BOOT msg received ---
    if (!config_sent && !stm32_booted && setup_done_ms > 0 &&
        (now_ms - setup_done_ms) > BOOT_TIMEOUT_MS) {
        Serial.println("[Boot] No BOOT message – sending config via fallback");
        sendBootConfig();
    }

    // --- Existing logic ---
    ensureWiFiAndServer();
    pollStm32Uart();
    serviceReadyHeartbeat();

    static uint32_t lastStatusReqMs = 0;
    uint32_t now = millis();

    // Dual-path voltage forwarding over TCP:
    // 1) raw STATUS2 at 500ms for high-resolution graph/calc consumers
    if ((now - lastStatus2Forward) > STATUS2_INTERVAL) {
        if (hasRawStatus2Data) {
            sendToPi(rawStatus2Packet);
            lastStatus2Forward = now;
        }
    }

    // 2) smoothed DISPLAY at 1000ms for stable UI labels
    if ((now - lastDisplayUpdate) > DISPLAY_INTERVAL) {
        if (hasRawStatus2Data) {
            sendToPi(buildDisplayPacket());
            lastDisplayUpdate = now;
        }
    }

    if ((now - lastStatusReqMs) >= 1000) {
        requestStm32Status();
        lastStatusReqMs = now;
    }

    // Guaranteed periodic STATUS push to Flask (every 2s), INDEPENDENT of the
    // STM32 STATUS response path above. The normal path only forwards a STATUS
    // to Flask when the STM32 replies; if the STM32 is briefly busy/quiet, the
    // dashboard could stall on stale values. This fallback ensures control_mode,
    // joule_target_j and the rest are pushed continuously even with no activity.
    static uint32_t lastStatusPushMs = 0;
    if (client && client.connected() && (now - lastStatusPushMs) >= 2000) {
        if ((now - lastStatusForwardMs) >= STATUS_FORWARD_MIN_INTERVAL_MS) {
            String s = buildStatus();
            Serial.printf("[TCP] Periodic STATUS -> Flask (mode=%u target=%.1fJ)\n",
                          (unsigned)control_mode, (double)joule_target_j);
            sendToPi(s);
            lastStatusForwardMs = now;
        }
        lastStatusPushMs = now;
    }

    if (WiFi.status() == WL_CONNECTED) {
        WiFiClient newClient = server.accept();
        if (newClient) {
            if (client && client.connected()) {
                Serial.println(
                    "[TCP] New client arrived -> dropping old client");
                client.stop();
            }

            client = newClient;
            client.setNoDelay(true);
            Serial.println("[TCP] Client connected from " +
                           client.remoteIP().toString());

            lastTcpRxMs = millis();
            setUiConnected(true);
            Serial.printf("[TCP] Flask connected -> sending STATUS immediately "
                          "(mode=%u target=%.1fJ)\n",
                          (unsigned)control_mode, (double)joule_target_j);
            sendToPi(buildStatus());
            syncSettingsAfterUiReconnect();
            requestStm32Status();
        }

        if (client && !client.connected()) {
            Serial.println("[TCP] Client disconnected");
            client.stop();
            setUiConnected(false);
        }

        if (client && client.connected() && TCP_IDLE_TIMEOUT_MS > 0) {
            if ((millis() - lastTcpRxMs) > TCP_IDLE_TIMEOUT_MS) {
                Serial.println("[TCP] Idle timeout -> dropping client");
                client.stop();
                setUiConnected(false);
            }
        }

        if (client && client.connected() && client.available()) {
            String line = client.readStringUntil('\n');
            line.trim();
            if (line.length() > 0) {
                lastTcpRxMs = millis();
                Serial.printf("[TCP] RX: %s\n", line.c_str());
                processCommand(line);
            }
        }
    }

    handleButton();

    // --- Drive UI touch-active flag from hardware touch driver state ---
    {
        bool hw_touch = (touch_filter.state == TOUCH_PRESSED ||
                         touch_filter.state == TOUCH_PENDING_PRESS ||
                         touch_filter.state == TOUCH_PENDING_RELEASE);
        ui_set_touch_active(hw_touch);
    }

    // --- Update on-screen UI (display-smoothing applied inside helper) ---
    // (Unreachable during OTA: loop() returns early above while ota_in_progress.)
    updateScreenDisplay();

    delay(5);
}

